{
  "10.1007/978-1-4419-0312-9_1": [
    "Bertelsen, O. W., Pold, S.: Criticism as an Approach to Interface Aesthetics. In: Nordic conference on Human-Computer Interaction, Tampere, Finland, pp. 23-32. ACM (2004)",
    "Judelman, G.: Aesthetics and Inspiration for Visualization Design: Bridging the Gap between Art and Science. In: International Conference on Information Visualisation (IV’04), pp. 245-250. IEEE (2004)",
    "Vande Moere, A.: Form follows Data: the Symbiosis between Design and Information Visualization. In: International Conference on Computer-Aided Architectural Design (CAADfutures’05), pp. 31-40. Vienna, Austria, OKK Verlag (2005).",
    "Sack, W.: Aesthetics of Information Visualization. In: Context Providers. C. Paul, V. Vesna and M. Lovejoy (eds.). Boston, MIT Press (2006)",
    "Pousman, Z., Stasko, J., Mateas, M.: Casual Information Visualization: Depictions of Data in Everyday Life. In: IEEE Transactions on Visualization and Computer Graphics 13(6): 1145-1152. IEEE Press (2007)",
    "Viegas, F. B., Wattenberg M.: Artistic Data Visualization: Beyond Visual Analytic. In: Lecture Notes in Computer Science 4564(15): 182-191. (2007)",
    "Lau, A., Vande Moere A.: Towards a Model of Information Aesthetic Visualization. In: International Conference on Information Visualisation (IV’07), Zurich, Switzerland, pp.87-92. IEEE (2007)",
    "Vesna, V.: Database Aesthetics - Art in the Age of Information Overflow, University of Information Overflow, University of Minnesota (2007).",
    "Zhao, J., Vande Moere A.: Embodiment in Data Sculpture: A Model of the Physical Visualization of Information. In: Conference on Digital Interactive Media in Entertainment and Arts (DIMEA’08), Athens, Greece, pp. 343-350. ACM (2008)",
    "Mautner, B.: Population One - One Person is One Pixel, URL, http://www.royalsapien.com/pop1/ (2006)",
    "Cafe, S.: Stan’s Cafe, Of All the People in All the World, URL, http://www.stanscafe.co.uk/ofallthepeople/ (2008)",
    "Wisneski, C., Ishii, H., Dahley A., Gorbet, M., Brave, S., Ullmer B., Yarin, P.: Ambient Displays: Turning Architectural Space into an Interface between People and Digital Information. In: International Workshop on Cooperative Buildings (CoBuild ’98), pp. 22-32. Springer (1998)",
    "Vande Moere, A.: infostudio: Teaching Ambient Display Design using Home Automation. In: Conference of the Australian Computer-Human Interaction (OZCHI’05), Canberra, ACM (2005)",
    "Ogden, C. K., Richards, I. A.: The Meaning of Meaning.” 8th Ed. New York, Harcourt, Brace & World, Inc. (1923)",
    "Johnson-Laird, P. N.: Analogy and the exercise of Creativity. In: Vosniadou, S and Ortony, A. (eds.) Similarity and Analogical Reasoning, pp 313—331. Cambridge University Press, New York (1989)",
    "Ware, C.: Information Visualization: Perception for Design. Morgan Kaufmann, San Francisco (2000)"
  ],
  "10.1007/978-1-4419-0312-9_2": [
    "A. Ahmed, T. Dwyer, M. F. X. Fu, J. W. K. Ho, S.-H. Hong, D. Koschuetzki, C. Murray, N. S. Nikolov, R. Taib, A. Tarassov, and K. Xu. Geomi: Geometry for maximum insight. In Proc. of Graph Drawing 2005, pages 468–479, 2005.",
    "C. Bachmaier, H. Buchner, M. Forster, and S.-H. Hong. Crossing minimization in extended level drawings of graphs. Discrete Applied Mathematics, to appear.",
    "U. Brandes and T. Erlebach, editors. Network Analysis: Methodological Foundations, volume 3418 of Lecture Notes in Computer Science. Springer, 2005.",
    "U. Brandes, M. Hoefer, and C. Pich. Affiliation dynamics with an application to movie-actor biographies. In Proc. of EuroVis 2006, pages 179–186, 2006.",
    "C. Chen. The centrality of pivotal points in the evolution of scientific networks. In Proc. Of IUI 2005, pages 98–105, 2005.",
    "X. Fu, S.-H. Hong, N. S. Nikolov, X. Shen, Y. Wu, and K. Xu. Visualization and analysis of email networks. In Proc. of APVIS 2007, pages 1–8, 2007.",
    "P. Gajer, M. T. Goodrich, and S. G. Kobourov. A multi-dimensional approach to forcedirected layouts of large graphs. In Proc. of Graph Drawing 2000, pages 211–221, 2000.",
    "D. Harel and Y. Koren. Graph drawing by high-dimensional embedding. In Proc. of Graph Drawing 2002, pages 207–219, 2002.",
    "S.-H. Hong and H. Nagamochi. Approximating crossing minimization in radial layouts. In Proc. of LATIN 2008, pages 461–472, 2008.",
    "K. Misue, P. Eades, W. Lai, and K. Sugiyama. Layout adjustment and the mental map. J. Vis. Lang. Comput., 6(2):183–210, 1995.",
    "J. Moody, D. McFarland, and S. Bender-deMoll. Dynamic network visualization. American Journal of Sociology, 110(4):1206–41, 2005.",
    "A. J. Quigley and P. Eades. Fade: Graph drawing, clustering, and visual abstraction. In Proc. of Graph Drawing 2000, pages 197–210, 2000.",
    "J. J. Thomas and K. A. Cook. Illuminating the Path: The Research and Development Agenda for Visual Analytics. National Visualization and Analytics Ctr, 2005.",
    "C. Walshaw. A multilevel algorithm for force-directed graph drawing. In Proc. of Graph Drawing 2000, pages 171–182, 2000.",
    "S. Wasserman and K. Faust. Social Network Analysis: Methods and Applicaitons. Cambridge University Press, 1995."
  ],
  "10.1007/978-1-4419-0312-9_3": [
    "Battista, G.D., Eades, P.: Algorithms for drawing graphs: an annotated bibliography. Computational Geometry. 4, 235–282 (1994)",
    "Battista, G.D., Eades, P., Tamassia, R., Tollis, I.G.: Graph Drawing: Algorithms for the Visualization of Graphs. Prentice Hall, New Jersey, USA (1999)",
    "Cormen, T.H., Leiserson, C.E., Rivest, R.L., Stein, C.: Introduction to Algorithms. MIT Press and McGraw-Hill, New York, USA (2001)",
    "Cruz, I.F., Twarog, J.P.: 3D Graph Drawing with Simulated Annealing. In: Proceedings of the Symposium on Graph Drawing, pp. 162–165. Springer-Verlag, London, UK (1995)",
    "Davidson, R., Harel, D.: Drawing Graphs Nicely Using Simulated Annealing, ACM Transactions on Graphics. 15, 301–331 (1996)",
    "Dijksta, E.W.: A note on two problems in connexion with graphs. Numerische Mathematik. 1, 269–271 (1959)",
    "Dolulil, J., Katreniakova, J.: Edge Routing with Fixed Node Positions. In: Proceedings of the 12th International Conference Information Visualisation, pp. 626–631. IEEE Computer Society Washington, DC, USA (2008)",
    "Dwyer, T., Marriott, K., Wybrow, M.: Integrating edge routing into force-directed layout. In: Proceedings 14th Intl. Symp. Graph Drawing (GD ’06), pp. 8–19. Springer-Verlag, Berlin, Heidelberg (2007)",
    "Eades, P.: A heuristic for graph drawing. Congressus Numerantium. 42, 149–160 (1984)",
    "Eades, P., Huang, M.L.: Navigating Clustered Graphs using Force-Directed Methods, Journal of Graph Algorithms and Applications. 4, 157–181 (2000)",
    "Eades, P., Lai, W., Misue, K., Sugiyama, K.: Layout adjustment and the mental map. Journal of Visual Languages and Computing. 6, 83–210 (1995)",
    "Forster, M.: Crossings in Clustered Level Graphs, Ph.D.Dissertation (2004)",
    "Healy, P., Nikolov, N.S.: Graph Drawing. Springer-Verlag, Berlin, Heidelberg (2006)",
    "Huang, X., Lai, W., Sajeev, A.S.M., Gao, J.: A new algorithm for removing node overlapping in graph visualization. Information Sciences. 177, 2821–2844 (2007)",
    "Kakoulis, K.G., Tollis, I.G.: A unified approach to labeling graphical features. In: Proceedings 14th Annual ACM Symposium of Computational Geometry (SoCG’98), pp. 347–356. ACM New York, NY, USA (1998)",
    "Kaufmann, M., Dorothea, W.: Drawing graphs, methods and models. Springer-Verlag, Berlin, Heidelberg (2001)",
    "Korb, K.B., Nicholson, A.E.: Bayesian Artificial Intelligence. Chapman & Hall, London, UK (2004)",
    "Kruskal, J.B.: On the Shortest Spanning Subtree of a Graph and the Traveling Salesman Problem. American Mathematical Society. 7, 48–50 (1956)",
    "Kumar, P., Zhang, K.: Social Network Analysis of Online Marketplaces. In: Proceedings IEEE International Conference on e-Business Engineering, pp. 363–367. IEEE Computer Society Washington, DC, USA (2007)",
    "Kumar, P., Zhang, K., Wang, Y.: Visualization of Clustered Directed Acyclic Graphs without Node Overlapping. In: Proceedings 12th International Conference on Information Visualization, pp. 38–43. IEEE Computer Society Washington, DC, USA (2008)",
    "Kumar, P., Zhang K.: Visualization of Clustered Directed Acyclic Graphs with Node Interleaving. In: Proceedings of the 24th Annual ACM Symposium on Applied Computing (SAC ‘09), pp. 1800–1805. ACM New York, NY, USA (2009)",
    "Kumar, P., Zhang, K.: Node Overlap Removal in Clustered Directed Acyclic Graphs. Journal of Visual Languages and Computing (JVLC). Article in press, doi:10.1016/j.jvlc.2009.04.007 (2009)",
    "Lai, W.: Layout Adjustment and Boundary Detection for a Diagram. In: Proceedings of Computer Graphics International (CGI ’01), pp. 351–354. IEEE Computer Society Washington, DC, USA (2001)",
    "Lai, W., Eades, P.: Removing edge-node intersections in drawings of graphs. Information Processing Letters. 81, 105–110 (2002)",
    "Larson, R.C., Li, V.O.K.: Finding minimum rectilinear distance paths in the paths in the presence of barriers. Networks. 11, 285–304 (1981)",
    "Lee, D.T., Preparata, F.P.: Euclidean shortest paths in the presence of rectilinear barriers. Networks. 14, 393–410 (1984)",
    "Leiserson, C.E.: Fat-Trees: Universal Networks for Hardware-Efficient Supercomputing. IEEE Transactions on Computers. 34, 892–901 (1985)",
    "Leymann, F.: Web Services Flow Language (WSFL 1.0), IBM (2001)",
    "Li, W., Eades, P., Nikolov, N.: Using spring algorithms to remove node overlapping. In: Proceedings of the 2005 Asia-Pacific symposium on Information visualization (APVIS ’05), pp. 131–140. Australian Computer Society, Inc. Darlinghurst, Australia (2005)",
    "Lozano-Perez, T., Wesley, M.A.: An algorithm for planning collision-free paths among polyhedral obstacles. Communications of ACM. 22, 22560–22570 (1979)",
    "Marriott, K., Stuckey, P., Vam, T., He, W.: Removing Node Overlapping in Graph Layout Using Constrained Optimization. Constraints. 8, 143–171 (2003)",
    "Nascimento, H.A.D., Eades, P.: User Hints for map labeling. Journal of Visual Languages and Computing. 19, 39–74 (2008)",
    "Papakostas, A., Tollis, I.G.: Interactive Orthogonal Graph Drawing. IEEE Transactions on Computers. 47, 1297–1309 (1998)",
    "Prim, R.C.: Shortest connection networks and some generalizations. Bell System Technical Journal. 36, 1389–1401 (1957)",
    "Purchase, H.C., Cohen, R.F., James, M.: Validating Graph Drawing Aesthetics. In: Proceedings of the Symposium on Graph Drawing (GD ’95), pp. 435–446. Springer-Verlag, London, UK (1995)",
    "Quigley A., Eades, P.: Graph Drawing, Clustering, and Visual Abstraction. In: Proceedings of the 8th International Symposium on Graph Drawing (GD ’00), pp. 197–210. Springer-Verlag, Berlin, Heidelberg (2000)",
    "Taylor, M., Rodgers, P.: Applying Graphical Design Techniques to Graph Visualization. In: Proceedings of the Ninth International Conference on Information Visualization (IV ’05), pp. 651–656. IEEE Computer Society Washington, DC, USA (2005)",
    "ConceptDraw, http://www.conceptdraw.com/en/products/cd5/main.php\n",
    "Home of Graphdrawing, http://www.graphdrawing.org\n",
    "Graphviz - Graph Visualization Software, http://www.graphviz.org\n",
    "Microsoft Office Online – Visio, http://office.microsoft.com/en-us/visio/default.aspx\n",
    "yWorks, http://www.yworks.com/products/yfiles/doc/developers-guide/index.html\n"
  ],
  "10.1007/978-1-4419-0312-9_4": [
    "James R. Akerman. Cartographies of travel and navigation. Univ. of Chicago Press, Chicago u.a., 2006.",
    "Patrick Baudisch and Ruth Rosenholtz. Halo: A technique for visualizing off-screen locations. Proc.CHI 03, pages 81–488, 2003.",
    "Gabriele Brandstetter. Figur und Inversion. Kartographie als Dispositiv von Bewegung, pages 223–245. de figura. Fink, Paderborn, 2002.",
    "Joachim B¨ottger, Ulrik Brandes, Oliver Deussen, and Hendrik Ziezold. Map warping for the annotation of metro maps. IEEE Computer Graphics and Applications, 28(5):56–65, 2008.",
    "Stefano Burigat and Luca Chittaro. Geographical data visualization on mobile devices for user’s navigation and decision support activities. Spatial Data on the Web–Modelling and Management, page 261–284, 2007.",
    "Tony Campbell. The earliest printed maps 1472-1500. British Library, London, 1987.",
    "Michel de Certeau. L’invention du quotidien. Arts de faire. Union Generale d’Editions, Paris,1980",
    "Ken Garland. Mr Beck’s Underground Map. Capital Transport Publishing, 38 Long Elmes, Harrow Eeald, Middlesex, 1994.",
    "Alfred Gell. How to read a map: Remarks on the practical logic of navigation. Man. The Journal of the Royal Anthropological Institute, 20:271–286, 1985.",
    "A. Goedvolk. De nieuwe relatieve afstand voor het openbaar vervoer. De nieuwe geografenkrant, 1988(10):6–7, 1988.",
    "J. Brian Harley. Deconstructing the map. Cartographica, 26.2:1–20, 1989.",
    "Lars Harrie, L. Tiina Sarjakoski, and Lassi Lehto. A variable-scale map for small-display cartography. Proc. Symposium on GeoSpatial Theory, Processing, and Applications, pages 8–12, 2002.",
    "T. Alan Keahey and Edward L. Robertson. Techniques for non-linear magnification transformations. In Proceedings of the IEEE Symposium on Information Visualization, pages 38–45, San Francisco, CA, USA, October 1996.",
    "Alexander Klippel, Kai-Florian Richter, Thomas Barkowsky, and Christian Freska. The cognitive reality of schematic maps. In Liqiu Meng, Alexander Zipf, and Tumasch Reichenbacher, editors, Map-based Mobile Services -Theories, Methods and Implementations, pages 57–74, Berlin, 2005. Springer.",
    "Herbert Kr¨uger. Oberdeutsche Meilenscheiben des 16. und 17. Jahrhunderts als strassengeschichtliche Quellen, I. Teil. Jahrbuch f¨ur fr¨ankische Landesforschung, 23:171–195, 1963.",
    "Herbert Kr¨uger. Oberdeutsche Meilenscheiben des 16. und 17. Jahrhunderts als strassengeschichtliche Quellen, II. Teil. Jahrbuch f¨ur fr¨ankische Landesforschung, 24:167–206, 1964.",
    "Sybille Kr¨amer. Medium, Bote, Ubertragung kleine Metaphysik der Medialit¨at. Suhrkamp, Frankfurt/M, 2008.",
    "Alan M. MacEachren. How maps work. representation, visualization, and design. The Guilford Press, New York u.a., 2004.",
    "Peter H. Meurer. Cartography in the German Lands, 1450 -1650, volume 3.2 of Cartography in the European Renaissance, pages 1172–1245. Chicago; London, 2007.",
    "Derek F. Reilly and Kori M. Inkpen. White rooms and morphing don’t mix: setting and the evaluation of visualization techniques. Proceedings of the SIGCHI conference on Human factors in computing systems, pages 111–120, 2007.",
    "Franz Schiermeier. Stadtatlas N¨urnberg Karten und Modelle der Stadt N¨urnberg von 1492 bis heute. Schiermeier, M¨unchen, 2006.",
    "Edward R. Tufte. Visual explanations images and quantities, evidence and narrative. Graphics Press, Cheshire, Conn., 1997.",
    "Marco Vencani. Rom als multiple Figur. Zur Geschichte einer umkaempften Stadtwahrnehmung (12. -14. Jh.). In Gottfried Boehm, Gabriele Brandstetter, and Achatz von M¨uller, editors, Figur und Figuration. Studien zu Wahrnehmung und Wissen, pages 357–370, Paderborn, 2007."
  ],
  "10.1007/978-1-4419-0312-9_5": [
    "Battista G.D., Eades P., Tamassia R., Tollis I.G.: Graph Drawing Algorithms for the Visualization of Graphs. Prentice Hall, New Jersey (1999)",
    "Herman I., Mellancon G., Marshall M.S.: Graph Visualization and Navigation in Information Visualization: a Survey. IEEE Transactions on Visualization and Computer Graphics. 6, 24–43 (2000)",
    "Graphviz, http://www.research.att.com/tools/graphviz\n",
    "Yee K.P., Fisher D., Dhamija R., Hearst M.S.: Animated exploration of dynamic graphs with radial layout. In: Proceedings of IEEE Symposium on Information(InfoVis’01), pp. 43–50. IEEE Computer Science Press, Los Alamitos (2001)",
    "Eades P., Feng Q.W.: Multilevel Visualization of Clustered Graphs. In: Proceedings of the 4th International Symposium on Graph Drawing, pp. 101–112. Springer, Heidelberg (1996)",
    "Eades P., Huang M.L.: Navigating Clustered Graphs using Force-Directed Methods. Journal of Graph Algorithms and Applications, 4, 157–181 (2000)",
    "Abello J., Van H.F., Krishnan N.: ASK-GraphView: a large scale graph visualization system. IEEE Transactions on Visualization and Computer Graphics. 12, 669–676 (2006)",
    "Hao M.C., Hsu M., Dayal U., Krug A.: Web-Based Visualization of Large Hierarchical Graphs Using Invisible Links in a Hyperbolic Space. In: Proceedings of Fifth Working Conference Visual Database Systems, pp. 83–94 (2000)",
    "Lee B., Parr C.S., Plaisant C., Berderson B.B.: TreePlus: Interactive exploration of networks with enhanced tree layouts. IEEE Transactions on Visualization and Computer Graphics. 12, 1414–1426 (2006)",
    "Furnas G.W.: A fisheye follow-up: further reflections on focus+context. In: Proceedings of the SIGCHI conference on Human Factors in computing systems, pp. 999–1008. ACM Press, New York (2006)",
    "Sarkar M., Brown M.: Graphical fisheye views. Communications of the ACM. 37, 73–84 (1994)",
    "Battista G.D., Eades P., Tamassia R., Tollis I.G.: Algorithms for Drawing Graphs: an Annotated Bibliography. Computational Geometry:Theory and Applications. 4, 235–282 (1994)",
    "Jia Y., Hoberock J., Garland M., Hart J.: On the Visualization of Social and other Scale-Free Networks. IEEE Transactions on Visualization and Computer Graphics. 14, 1285— 1292 (2008)",
    "Cui W., Zhou H., Qu H., Wong P.C., Li X.: Geometry-based edge clustering for graph visualization. IEEE Transactions on Visualization and Computer Graphics, 14, 1277—1284 (2008)",
    "Munzner T.: Drawing Large Graphs with H3Viewer and SiteManager. In: Proceedings of Graph Drawing. LNCS, vol. 1547, pp. 384—393. Springer, Heidelberg (1998)",
    "Card S.K., Nation D.: Degree-of-Interest Trees: A Component of an Attention-Reactive User Interface. In: Proceedings of Advanced Visual Interfaces. (2002)",
    "Radialgraphview, http://prefuse.org/gallery/radialgraphview\n"
  ],
  "10.1007/978-1-4419-0312-9_6": [
    "A. Inselberg and B. Dimsdale. Parallel Coordinates: A Tool for Visualizing Multi-Dimensional Geometry. In proceedings of Visualization ’90, pages 361–370, 1990.",
    "M. Kaufmann and D. Wagner. Drawing Graphs, Springer, 2001.",
    "R. Rudell. Dynamic Variable Ordering for Ordered Binary Decision Diagrams. In Proceedings of the 1993 IEEE/ACM International Conference on Computer-aided Design (ICCAD ’93), pages 42–47.",
    "C. Matuszewski, R. Schönfeld, and P. Molitor. Using Sifting for k-Layer Straightline Crossing Minimization. In Proceedings of 7th Graph Drawing Conference (GD ’99), pages 217–224.",
    "Daniel A. Keim. Designing Pixel-Oriented Visualization Techniques: Theory and Applications. IEEE Transaction on Visualization and Computer Graphics, 6(1):59–78, 2000.",
    "E.R. Tufte. The Visual Display of Quantitative Information. Graphics Press, 1983.",
    "Colin Ware, Helen Purchase, Linda Colpoys and Matthew McGill. Cognitive Measurements of Graph Aesthetics. Information Visualization, 1(2): 103–110, 2002.",
    "Huang, W. and Eades, P. How people read graphs. In Proceedings Asia Pacific Symposium on Information Visualization (APVIS 2005), 47–53.",
    "Christian Bachmaier. A Radial Adaptation of the Sugiyama Framework for Visualizing Hierarchical Information. IEEE Transaction on Visualization and Computer Graphic, 13(3):583–594, 2007.",
    "U. Brandes, P. Kenis, and D. Wagner. Communicating Centrality in Policy Network Drawings. IEEE Transaction on Visualization and Computer Graphics, 9(2):241–253, 2003.",
    "Harri Siirtolam and Kari-Jouko Raiha. Interacting with parallel coordinates. Interacting with Computers, 18(6):1278–1309, 2006.",
    "Y.-H. Fua, M. O. Ward, and E. A. Rundensteiner. Hierarchical parallel coordinates for exploration of large datasets. In Proc. of IEEE Visualization, pages 43–50, 1999.",
    "Jimmy Johansson, Patric Ljung, Mikael Jern and Matthew Cooper. Revealing Structure within Clustered Parallel Coordinates Displays. In Proceedings of the 2005 IEEE Symposium on Information Visualization (INFOVIS’05), pages 125–132.",
    "Robert Kosara, Fabian Bendix, and Helwig Hauser. Parallel Sets: Interactive Exploration and Visual Analysis of Categorical Data. IEEE Transaction on Visualization and Computer Graphics, 12(4):558–568, 2006.",
    "Geoffrey Ellis and Alan Dix. Enabling Automatic Clutter Reduction in Parallel Coordinates Plots. IEEE Transaction on Visualization and Computer Graphics, 12(5):717–723, 2006.",
    "Matej Novotny and Helwig Hauser. Outlier-preserving Focus+Context Visualization in Parallel Coordinates. IEEE Transaction on Visualization and Computer Graphics, 12(5):893-900, 2006.",
    "Ying-Huey Fua, Matthew O. Ward and Elke A. Rundensteiner. Navigating Hierarchies with Structure-Based Brushes. In Proceedings of the 1999 IEEE Symposium on Information Visualization (INFOVIS’99), pages 58–64.",
    "Jimmy Johansson, Matthew Cooper and Mikael Jern. 3-Dimensional Display for Clustered Multi-Relational Parallel Coordinates. In Proceedings of the Ninth International Conference on Information Visualisation (IV’05), pages 188–193.",
    "Emilio Di Giacomo, Walter Didimo, Giuseppe Liotta. Radial Drawings of Graphs: Geometric Constraints and Trade-off. In Proceedings of 7th Graph Drawing Conference (GD’06), pages 355–366.",
    "G.P. Ellis and A. Dix. Density control through random sampling : an architectural perspective. In Proceedings of International Conference on Information Visualization (IV’02), pages 82-90.",
    "Almir Oivertte Artero, Maria Cristina Ferreira de Oliveria and Haim Levkowitz. Uncovering Clusters in Crowded Parallel Coordinates Visualizations. In Proceedings of the 2004 IEEE Symposium on Information Visualization (INFOVIS’04), pages 81–88.",
    "Daniel A. Keim. Information Visualization and Visual Data Mining. IEEE Transaction on Visualization and Computer Graphics, 8(1):1–8, 2002.",
    "Wei Peng, Matthew O. Ward, and Elke A. Rundensteiner. Clutter Reduction in Multi-Dimensional Data Visualization Using Dimension Reordering. In Proceedings of the IEEE Symposium on Information Visualization 2004 (INFOVIS’04), pages 89–96.",
    "Keim, D.A.; Mansmann, F.; Schneidewind, J.; Schreck, T., Monitoring Network Traffic with Radial Traffic Analyzer Visual Analytics And Technology. In proceedings IEEE Symposium on Visual Analytics Science and Technology 2006 (VAST 2006), pages:123–128",
    "Roel Vliegen, Jarke J.van Wijk and Erik-Jan van der Linden. Visualizing Business Data with Generalized Treemaps, IEEE Transaction on. Visualization and Computer Graphics, 12(5):789-796, 2006.",
    "Wegenkittl R, Löffelmann H, Gröller E. Visualizing the behaviour of higher dimensional dynamical systems. IEEE Visualization 1997 (Phoenix, USA, 1997), ACM Press: New York; 119125",
    "Tominski C, Abello J, Schumann H. Axes-based visualizations with radial layouts. ACM Symposium on Applied Computing 2004 (Nicosia, Cyprus, 2004), ACM Press: New York; 12421247.",
    "Forsell C, Johansson J. Task-based evaluation of multi-relational 3D and standard 2D parallel coordinates. IS&T/SPIE’s International Symposium on Electronic Imaging, Conference on Visualization and Data Analysis 2007 (San Jose, USA, 2007), SPIE: Bellingham and IS&T:Springfield; 64950C-112.",
    "C.Muelder, , Ma, K.L., Bartoletti, T.: A visualization methodology for characterization of network scans. Visualization for Computer Security, IEEE Workshops, pp. 4–4 (2005)",
    "G.Conti,Abdullah, K.: “Passive visual fingerprinting of network attack tools”. VizSEC/DMSEC ’04: Proceedings of the 2004 ACM Workshop on Visualization and Data Mining for Computer Security, 2004,pp. 45–54",
    "J.McPherson, ,Ma, K.L., Krystosk, P., Bartoletti, T., Christensen,M.: Portvis: “A tool for port-based detection of security events”. In: ACM VizSEC 2004 Workshop, 2004,pp.73–81",
    "Pin Ren, Yan Gao and Zhichun Li, “IDGraphs: Intrusion Detection and Analysis Using Histographs”, Visualization for Computer Security, 2005, pp.39-46"
  ],
  "10.1007/978-1-4419-0312-9_7": [
    "Google Image Search, http://images.google.com/.",
    "Mougenot C., Bouchard C., Aoussat A., Fostering innovation in early design stage: a study of inspirational process in car design companies, Wonderground 2006 in proc. of the Design Research Society International conference, Portugal 2006.",
    "Getty Images, www.gettyimages.com.",
    "Flickr, http://www.flickr.com/.",
    "Popular categories in iStockphoto, http://www.istockphoto.com/popular.php.",
    "Feng Jing , Changhu Wang , Yuhuan Yao , Kefeng Deng , Lei Zhang , Wei-Ying Ma, IGroup: web image search results clustering, Proceedings of the 14th annual ACM international conference on Multimedia, October 23-27, 2006, Santa Barbara, CA, USA.",
    "P.-A. Mo¨ellic, J.-E. Haugeard, and G. Pitel. Image clustering based on a shared nearest neighbors approach for tagged collections. In CIVR ’08: Proceedings of the 2008 international conference onContent-based image and video retrieval, pages 269–278, New York, NY, USA, 2008. ACM.",
    "Fellbaum, Christiane, editor. 1998. WordNet:An Electronic Lexical Database. MIT Press, Cambridge, Massachusetts.",
    "Liu Y., Zhang D., Lu G., Ma W.Y., A survey of content-based image retrieval with highlevel semantics, Pattern Recognition, 40 (2007), pp 262-282.",
    "G. Salton. Automatic Text Processing: The Transformation, Analysis, and Retrieval of Information by Computer. Addison-Wesley, 1989.",
    "F. Beil, M. Ester, and X. Xu. Frequent term-based text clustering. In Proc. 8th Int. Conf. on Knowledge Discovery and Data Mining (KDD)’2002, Edmonton, Alberta, Canada, 2002.",
    "Zhao, Y. & Karypis, G. (2001). Criterion functions for document clustering: Experiments and analysis. Technical Report TR #01–40, Department of Computer Science, University of Minnesota, Minneapolis, MN.",
    "Y Zhao and G Karypis. 2005. Hierarchical clustering algorithms for document data sets. Data Mining and Knowledge Discovery, 10(2):141.168.",
    "Cluto, http://glaros.dtc.umn.edu/gkhome/views/cluto.",
    "Google Analytics, http://www.google.com/analytics/.",
    "Toglia MP, Battig WF(1978): Handbook of Semantic Word Norms. Hillsdale, NJ: Erlbaum."
  ],
  "10.1007/978-1-4419-0312-9_8": [
    "Rekers J., Schürr A.: Defining and Parsing Visual Languages with Layered Graph Grammars. Journal of Visual Languages and Computing 8(1), 27–55 (1997)",
    "Zhang D.Q., Zhang K., Cao J.: A Context-Sensitive Graph Grammar Formalism for the Specification of Visual Languages. The Computer Journal 44(3), 187–200 (2001)",
    "Zhang K., Zhang D.Q., Deng Y.: A Visual Approach to XML Document Design and Transformation. In: 18th IEEE International Symposium on Human-Centric Computing Languages and Environments, pp. 312–319. IEEE Press, Washington, DC (2001)",
    "Zhang K., Kong J., Qiu M.K., G.L. Song: Multimedia Layout Adaptation through Grammatical Specifications. ACM/Springer Multimedia Systems 10(3), 245–260 (2005)",
    "Kong J., Zhang K., Zeng X.: Spatial Graph Grammars for Graphical User Interfaces. ACM Transactions on Computer-Human Interaction 13(2), 268–307 (2006)",
    "Song G.L., Zhang K., Kong J.: Model Management through Graph Transformations. In: 21st IEEE International Symposium on Visual Languages and Human-Centric Computing, pp. 75–82. IEEE Press, Washington, DC (2004)",
    "Zhao C.Y., Kong J., Dong J., Zhang K.: Pattern Based Design Evolution Using Graph Transformation. Journal of Visual Languages and Computing 18(4), 378–398 (2007)",
    "Zou Y., Zeng X.Q., Han X.Q., Zhang K.: Context-Attributed Graph Grammar Framework for Specifying Visual Languages. Journal of Southeast University (English Edition) 24(4), 455-461 (2008)",
    "Zeng X.Q., Han X.Q., Zou Y.: An Edge-Based Context-Sensitive Graph Grammar Formalism. Journal of Software 19(8), 1893–1901 (2008) (in Chinese)",
    "Zeng X.Q., Zhang K., Kong J., Song G.L.: RGG+: An Enhancement to the Reserved Graph Grammar Formalism. In: 22nd IEEE International Symposium on Visual Languages and Human-Centric Computing, pp. 272–274. IEEE Press, Washington, DC (2005)",
    "Bottoni P., Taentzer G., Schürr A.: Efficient Parsing of Visual Languages based on Critical Pair Analysis and Contextual Layered Graph Transformation. In: 17th IEEE International Symposium on Visual Languages, pp.5–60. IEEE Press, Washington, DC (2000)"
  ],
  "10.1007/978-1-4419-0312-9_9": [
    "Huang, Shieh and Chi.: Factor affecting the design of computer icons. International Journal of Industrial Ergonomics. Volume 29, Issue 4, p. 211-218. Elsevier Science (2002).",
    "Horton, W.: The icon book: visual symbols for computer system and documentation, John and Sons (1994).",
    "Sassoon, R. and A.: Signs, symbols and Icons: Pre-history to the computer age. Intellect Book (1997).",
    "Catarci, T., Massari, A. and Santucci, G.: Iconic and diagrammatic interface: an integrated approach. IEEE (1991).",
    "Bartram, L. Ware, C. and Calvert, T.: Moving icons: detection and distraction. Human-Computer Interaction-INTRACT’01, 1OS Press (2001).",
    "Szabo, A.J.: Graphical user interface for database system, US Patent Issued on. October 12, 1999. Retrieved March. 26, 2007 from: http://www.patentstorm.us/patents/5966126-description.html.",
    "Conway, B.R.: Color vision, cones, and color-coding in the cortex. The neuroscientist, Jun 2009, vol 15: pp.274-291 (2009).",
    "Marcus, A.: Principles of effective visual communication for graphical user interface design. Human-Computer interaction: toward the year 2000. Morgan Kaufmann Publishers Inc. San Francisco, CA, USA (1995).",
    "Murch, G.: Color graphics - blessing or ballyhoo. Human-Computer Interaction: Toward the Year 2000. Excerpt in: Baecker, Ronald M. et al. (etd.). Morgan Kaufmann, (1995), p 442-443.San Francisco, CA (1995).",
    "Baecker, R., Small I, and Mander R.: Bringing icons to life. Conference on Human Factors in Computing Systems. Proceedings of the SIGCHI conference on Human factors in computing systems: Reaching through technology. (1-6). ACM Press, New York, NY, USA (1991).",
    "Payne R.O and Starren, J.: Presentation discovery: Building a better icon. Conference on Human Factors in Computing Systems. CHI 2006, April 22-27, 2006, Montreal, Quebec, Canada.ACM Press, New York, NY, USA (2006).",
    "Meier, B.J.: ACE:A color expert system for user interface design. Symposium on User Interface Software and Technology. Proceedings of the 1st annual ACM SIGGRAPH symposium on User Interface Software. ACM Press New York, NY, USA (1988).",
    "Lamberski, R.: The instructional effect of color in immediate and delayed retention. Journal of Instructional Psychology, pp.122-131 (1982).",
    "Tufte, E.: Envisioning information. Graphics Press, Cheshire, Connecticut, USA (1990).",
    "Pett, D. and Wilson, T.: Color research and its application to the design of instructional materials. ETR&D. Vol. 44, No. 3, 1996. pp.19 (1999)."
  ],
  "10.1007/978-1-4419-0312-9_10": [
    "World Health Organization: Summary of probable SARS cases with onset of illness from 1 November 2002 to 31 July 2003. http://www.who.int/csr/sars/country/table2004_04_21/en/\n",
    "World Health Organization: Ten things you need to know about pandemic influenza. http://www.who.int/csr/disease/influenza/pandemic10things/en/\n",
    "Zeng, D., Chen, H., Tseng, C., Larson, C.A., Eidson, M., Gotham, I., Lynch, C., Ascher, M.: Towards a national infectious disease information infrastructure: a case study in West Nile virus and botulism. In: 2004 Annual National Conference on Digital Government Research, Seattle, WA, IEEE (2004) 1–10",
    "SAHANA, Free and open source disaster management system. http://www.sahana.lk/\n",
    "Xu, J.J., Chen, H.: Criminal network analysis and visualization. Communications of ACM 48(6) (2005) 100–107",
    "Xu, J.J., Chen, H.: CrimeNet explorer: a framework for criminal network knowledge discovery. ACM Transactions on Information Systems 23(2) (2005) 201–226",
    "Torgerson, W.S.: Multidimensional scaling: I. Theory and method. Psychometrika 17 (1952)",
    "JUNG, Java Universal Network/Graph Framework. http://jung.sourceforge.net/\n",
    "MySQL homepage. http://www.mysql.com/\n",
    "Goddard, N.L., Delpecha, V.C., Watsona, J.M., Reganb, M., , A., N.: Lessons learned from SARS: The experience of the health protection agency, England. Public Health 120(1) (2006) 27–32",
    "Wang, G., Chen, H., Atabakhsh, H.: Automatically detecting deceptive criminal identities. Communication of ACM 47(3) (2004) 70–76",
    "Leong, K.I., Si, Y.W., Biuk-Aghai, R.P., Fong, S.: Contact tracing in health-care digital ecosystems for infectious disease control and quarantine management. In: Third IEEE International Conference on Digital Ecosystems and Technologies (DEST 2009), IEEE (2009) 210–215",
    "Tsang, K.W., Ho, P.L., Ooi, G.C., Yee, W.K., Wang, T., Chan-Yeung, M., Lam, W.K., Seto, W.H., Yam, L.Y., Cheung, T.M., Wong, P.C., Lam, B., Ip, M.S., Chan, J., Yuen, K.Y., Lai, K.N.: A cluster of cases of severe acute respiratory syndrome in Hong Kong. The New England Journal of Medicine 348(20) (2003) 1977–85",
    "Abraham, T.: Twenty–First Century Plague -The Story of SARS. Johns Hopkins University Press (2005)",
    "The SARS Expert Committee of Hong Kong: Report of the SARS expert committee -SARS in hong kong: from experience to action. http://www.sarsexpertcom.gov.hk/english/reports/reports.html (2003)",
    "The Hong Kong Legislative Council: Report of the select committee to inquire into the handling of the severe acute respiratory syndrome outbreak by the government and the hospital authority. http://www.legco.gov.hk/yr03-04/english/sc/sc_sars/reports/sars_rpt.htm (July 2004)",
    "Huxtable, N.: Population density hinders fight against TB. Macau Daily Times (28 June 2008)",
    "Centers for Disease Control and Prevention: Interim guidance for clinicians on identifying and caring for patients with Swine–origin Influenza A (H1N1) virus infection. http://www.cdc.gov/h1n1flu/identifyingpatients.htm\n",
    "Wang, T.D., Plaisant, C., Quinn, A.J., Stanchak, R., Murphy, S., Shneiderman, B.: Aligning temporal data by sentinel events: discovering patterns in electronic health records. In: The twenty-sixth annual SIGCHI conference on Human factors in computing systems, CHI ’08, New York, NY, USA, ACM (2008) 457–466",
    "LingPipe. http://www.alias-i.com/lingpipe/\n",
    "Cohen, W.W., Arawagi, S.: Exploiting dictionaries in named entity extraction: combining semi-Markov extraction processes and data integration methods. In: Tenth ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, KDD ’04, New York, NY, ACM (2004) 89–98"
  ],
  "10.1007/978-1-4419-0312-9_11": [
    "Card, S. K., Mackinlay, J. D., and Shneiderman, B., editors. Readings in Information Visualization: Using Vision to Think. Morgan Kaufmann, 1999.",
    "J. Jeong, F. Hussain. On the identification of a vortex. Journal of Fluid Mechanics. Vol1, No.285, pp: 69∼94, 1995.",
    "WU J.-Z., XIONG A.-K., YANG Y.-T.: Axial stretching and vortex definition. Physics of Fluids 17, 2005.",
    "S. K. Robinson. Coherent motions in the turbulent boundary layer. Ann. Rev. Fluid Mechanics, 23, pp: 601∼639, 1991.",
    "L. M. Portela. Identification and characterization of vortices in the turbulent boundary layer. PhD thesis, Stanford University, 1997.",
    "M. Jiang, R. Machiraju, D. Thompson. A novel approach to vortex core region detection. In: Joint Eurographics-IEEE TCVG Symposium on Visualization, pp: 217∼225, 2002.",
    "Jincheng Xiong, Lectures based on Point Set Topology (The Third Edition), Bejing Education Publishing House. 249∼255, 2003.",
    "Sobolev, V. I., “Brouwer theorem”, in Hazewinkel, Michiel, Encyclopaedia of Mathematics, Kluwer Academic Publishers, 2001.",
    "M. Jiang, R. Machiraju, and D. S. Thompson, Geometric Verification of Swirling Features in Flow Fields. In IEEE Visualization ’02, pages 307–314, 2002.",
    "POST F. H., VROLIJK B., HAUSER H., LARAMEE R. S., DOLEISCH H.: The state of the art in flow visualization: Feature extraction and tracking. Computer Graphics Forum 22, 4 (2003), 775–792.",
    "JEONG J., HUSSAIN F.: On the identification of a vortex. Journal of Fluid Mechanics 285 (1995), 69–94. 6 (1990), 721–724.",
    "PEIKERT R., ROTH M.: The “parallel vectors” operator –a vector field visualization primitive. In Proc. IEEE Visualization ’99 (1999), pp. 263–270.",
    "SAHNER J., WEINKAUF T., HEGE H.-C.: Galilean invariant extraction and iconic representation of vortex core lines. In Proc. EG / IEEE VGTC Symposium on Visualization (Eurovis)(2005), pp. 151–160.",
    "STEGMAIER S., RIST U., ERTL T.: Opening the can of worms: An exploration tool for vortical flows. In Proc. IEEE Visualization ’05 (2005), pp. 463–470.",
    "THEISEL H., SAHNER J., WEINKAUF T., HEGE H.-C., SEIDEL H.-P.: Extraction of parallel vector surfaces in 3D time-dependent fields and application to vortex core line tracking.In Proc. IEEE Visualization ’05 (2005), pp. 631–638.",
    "WEINKAUF T., SAHNER J., THEISEL H., HEGE H.-C.: Cores of swirling particle motion in usteady flows. IEEE Transactions on Visualization and Computer Graphics (Proc. Visualization 2007) 13, 6 (2007), 1759–1766.",
    "I. A. Sadarjoen. Extraction and Visualization of Geometries in Fluid Flow Fields. PhD thesis, Delft University of Technology, 1999.",
    "I. A. Sadarjoen, F. H. Post, B. Ma, D. C. Banks, and H.-G. Pagendarm. Selective Visualization of Vortices in Hydrodynamic Flows. In Proc. Visualization ’98, pages 419–422,558, 1998.",
    "F. H. Post., W. C. DeLeeuw, I. Ari Sadarjoen, et al. Global, geometric, and feature-based techniques for vector field visualization. Future Generation Computer Systems, pp: 87∼98, 1999.",
    "SCHEUERMANN G., HAGEN H., KRÜGER H., MENZEL M., ROCKWOOD A.: Visualization of higher order singularities in vector fields. In VIS ’97: Proceedings of the 8th conference on Visualization ’97 (1997), IEEE Computer Society Press, pp. 67–74.",
    "BAUER D., PEIKERT R.: Vortex tracking in scale-space. In Proc. EG / IEEE TCVG Symposium on Visualization ’02 (2002), pp. 233–240.",
    "SINGER B. A., BANKS D. C.: A predictor-corrector scheme for vortex identification. Tech. Rep. ICASE 94-11, NASA CR-194882, 1994.",
    "SAHNER J., WEINKAUF T., HEGE H.-C.: Galilean invariant extraction and iconic representation of vortex core lines. In Proc. EG / IEEE VGTC Symposium on Visualization (Eurovis) (2005), pp. 151–160.",
    "SUJUDI D., HAIMES R.: Identification of swirling flow in 3D vector fields. Tech. Rep. AIAA 95-1715, Dept. of Aeronautics and Astronautics, MIT, Cambridge, MA, 1995.",
    "JIANG M., MACHIRAJU R., THOMPSON D.: Detection and visualization of vortices. In The Visualization Handbook, Hansen C. D., Johnson C. R., (Eds.). Elsevier, Amsterdam, 2005, pp. 295–309.",
    "HASSOUNA M. S., FARAG A. A.: On the extraction of curve skeletons using gradient vector flow. Proc. ICCV 2007 (2007), 1–8.",
    "M. Henle. A Combinatorial Introduction to Topology. Dover, 1979."
  ],
  "10.1007/978-1-4419-0312-9_12": [
    "X. Yin, W. Yurcik,: et al. “VisFlowConnect: NetFlow Visualizations of Link Relationships for Security Situational Awareness.” Proceedings of the 2004 ACM Workshop on Visualization and Data Mining for Computer Security. Washington, DC, USA, ACM Press.",
    "Robert F. Erbacher.: “Visual traffic monitoring and evaluation”. In Proceedings of the Conference on Internet Performance and Control of Network Systems II, 2001, pp 153–160.",
    "L. Girardin and D. Brodbeck.: “A visual approach for monitoring logs”. In Proceedings of the 12th Usenix System Administration conference, 1998, pp 299–308.",
    "Chris Muelder, Kwan-Liu Ma and Tony Bartoletti,: A Visualization Methodology for Characterization of Network Scans, Visualization for Computer Security, 2005, pp.29-38",
    "J. Pearlman, P.R.: Visualizing Network Security Events Using Compound Glyphs from a Service-Oriented Perspective. In Visualization for Computer Security. VizSEC 2007:Proceedings of the Workshop on Visualization for Computer Security, 2007, pp. 131∼146.",
    "Chris P. Lee, J.T., Nicholas Gibbs,Raheem Beyah,John A. Copeland.: Visual Firewall: Realtime Network Security Monitor. in IEEE Workshop on Visualization for Computer Security 2005 (VizSEC 05), 2005:129∼136.",
    "Christos Papadopoulos, C.K., Alexander Sawchuk, Xinming He. CyberSeer: 3D Audio-Visual Immersion for Network Security and Management. in the 2004 ACM Workshop on Visualization and Data Mining for Computer Security. 2004. Washington, DC, USA: ACM Press,pp:90∼98.",
    "A. Hussain, J.H.a.C.P.: A Framework for Classifying Denial of Service Attacks. in Sigcomm 2003. Karlsruhe, Germany. 2003:99∼110.",
    "Muelder, C., Ma, K.L., Bartoletti, T.: A visualization methodology for characterization of network scans. Visualization for Computer Security, IEEE Workshops, 2005, pp. 4 - 4.",
    "Conti, G., Abdullah, K.: “Passive visual fingerprinting of network attack tools”. VizSEC/DMSEC ’04: Proceedings of the 2004 ACM Workshop on Visualization and Data Mining for Computer Security, 2004,pp. 45 - 54",
    "Jonathan McPherson, Kwan-Liu Ma, Paul Krystosk, Tony Bartoletti, Marvin Christensen.:Portvis: “A tool for port-based detection of security events”. In: ACM VizSEC 2004 Workshop, 2004, pp. 73 - 81",
    "Pin Ren, Yan Gao and Zhichun Li,: “IDGraphs: Intrusion Detection and Analysis Using Histographs”, Visualization for Computer Security, 2005, pp.39-46",
    "Stuart K. Card, Jock D. Mackinlay and Ben Shneiderman,: “Readings in information visualization: using vision to think”, Morgan Kaufmann Publishers, 1999",
    "Rawiroj Robert Kasemsri,: “A Survey, Taxonomy, and Analysis of Network Security Visualization Techniques” [Master Paper], USA, Georgia State University, 2005",
    "Richard A. Becker, Stephen G. Eick, and Allan R.Wilks. :“Visualizing network data”. IEEE Transactions on Visualization and ComputerGraphics,1995 1(1):pp.16–28.",
    "Prefuse, http://www.prefuse.org/\n",
    "Mukosaka, S.;,Koike, H.:“Integrated visualization system for monitoring security in largescale local area network Visualization”,APVIS ’.2007 6th International Asia-Pacific Symposium, 2007,pp.41– 44",
    "Musa, Shahrulniza, Parish,etc.: “Visualizing Communication Network Security Attacks”,Information Visualization,IV ’07. 11th Internati onal Conference, 2007, pp. 726-733",
    "Pavel Minarik1 , Tomas Dymacek.: “NetFlow Data Visualization Based on Graphs”, In Visualization for Computer Security ,VizSEC 2008: Proceedings of the Workshop on Visualization for Computer Security, 2008, pp. 144-151"
  ],
  "10.1007/978-1-4419-0312-9_13": [
    "Borgman, C.L.: Why are online catalogs hard to use? lessons learned from informationretrieval studies. Journal of the American Society for Information Science 37(6) (1986) 387–400",
    "Bates, M.: Subject access in online catalogs: A design model. Journal of the American Society for Information Science 37(6) (1986) 357–376",
    "Vakkari, P.: Task complexity, problem structure and information actions -integrating studies on information seeking and retrieval. Information Processing and Management 35(6) (1999) 819–837",
    "Bates, M.: The design of browsing and berrypicking techniques for the online search interface. Online Review 13(5) (1989) 407–424",
    "Simon, H.A.: The structure of ill-structured problems. Artificial Intelligence 4 (1973) 181–201",
    "Barry, C.L.: User-defined relevance criteria: An exploratory study. Journal of the American Society for Information Science 45(3) (1994) 149–159",
    "Anderson, T.D.: Studying human judgments of relevance: interactions in context. In Ruthven, I., ed.: Proceedings of the 1st international conference on Information interaction in context, ACM (2006) 6–14",
    "Cutting, D.R., Karger, D.R., Pedersen, J.O., Tukey, J.W.: Scatter/gather: a cluster-based approach to browsing large document collections. In: SIGIR ’92: Proceedings of the 15th annual international ACM SIGIR conference on Research and development in information retrieval, New York, NY, USA, ACM Press (1992) 318–329",
    "Marchionini, G.: Information seeking in electronic environments. Cambridge University Press, New York, NY, USA (1995)",
    "Harter, S.: Online information retrieval: Concepts, principles, and techniques. Academic Press, Orlando, FL (1986)",
    "Hearst, M.A.: Uis for faceted navigation: Recent advances and remaining open problems. In: in the Workshop on Computer Interaction and Information Retrieval, HCIR 2008. (2008)",
    "Meadow, C., Cochrane, P.: Basics of online searching. John Wiley and Sons, New York (1981)",
    "Hawkins, D.T., Wagers, R.: Online bibliographic search strategy development. (1989) 88–95",
    "Vigil, P.J.: The psychology of online searching. Journal of the American Society for Information Science 34(4) (1983) 281–287",
    "McKiernan, G.: New age navigation: Innovative information interfaces for electronic journals. The Serials Librarian 45(2) (2003) 87–123",
    "Zhang, J., Mostafa, J., Tripathy, H.: Information retrieval by semantic analysis and visualization of the concept space of d-lib magazine. D-Lib Magazine 8(10) (October 2002)",
    "Robertson, G.G., Mackinlay, J.D., Card, S.K.: Cone trees: animated 3d visualizations of hierarchical information. In: CHI ’91: Proceedings of the SIGCHI conference on Human factors in computing systems, New York, NY, USA, ACM (1991) 189–194",
    "Mizukoshi, D., Hori, Y., Gotho, T.: Extension models of cone tree visualizations to large scale knowledge base with semantic relations. In: The 14th International Conference in Central Europe on Computer Graphics, Visualization and Computer Vision’2006. (2006)",
    "Venn, J.: On the diagrammatic and mechanical representation of propositions and reasonings. Philosophical Magazine and Journal of Science 9(50) (1880)"
  ],
  "10.1007/978-1-4419-0312-9_14": [
    "Card S.K., Mackinlay J.D., Shneiderman B.: Readings in Information Visualization:Using Vision to Think. Morgan Kaufmann, San Francisco (1999)",
    "Shneiderman B.: Dynamic queries for visual information seeking. IEEE Software. 11, 70–77 (1994)",
    "Hornbæk K., Bederson B.B., Plaisant C.: Navigation patterns and usability of zoomable user interfaces with and without an overview. ACM Transactions on Computer-Human Interaction(TOCHI). 9, 362–389 (2006)",
    "Furnas G.W.: A fisheye follow-up: further reflections on focus+context. In: Proceedings of the SIGCHI conference on Human Factors in computing systems, pp. 999–1008. ACM Press, New York (2006)",
    "Baldonado M.Q., Woodruff A., Kuchinsky A.: Guidelines for using multiple views in information visualization. In: Proceedings of the working conference on Advanced Visual Interfaces(AVI’00), pp. 111–119. ACM Press, New York (2000)",
    "Shneiderman B.: The eyes have it: A task by data type taxonomy for information visualizations. In: Proceedings of IEEE Workshop Visual Languages, pp. 336–343. IEEE Computer Science Press, Los Alamitos (1996)",
    "Heer J., Card S.K., Landy J.A.: Prefuse: A toolkit for interactive information visualization. In: Proceedings of the SIGCHI conference on Human Factors in computing systems(CHI’05), pp. 421–430. ACM Press, New York (2005)",
    "Bederson B.B., Hollan J.D., Perlin K., Meyer J., Bacon D., Furnas G.W.: Pad++: A zoomable graphical sketchpad for exploring alternate interface physics. Journal of Visual Language and Computing. 7, 7–31 (1996)",
    "Bederson B.B., Meyer J., Good L.: Jazz: An extensible zoomable user interface graphics toolkit in Java. In: Proceedings of ACM Symposium on User Interface Software and Technology(UIST’00), pp. 171–180. ACM Press, New York (2000)",
    "Bederson B.B., Grosjean J., Meyer J.: Toolkit Design for Interactive Structured Graphics. IEEE Transactions on Software Engineering. 30, 535–546 (2004)",
    "North C., Shneiderman B.: Snap-Together Visualization: A user Interface for coordinating visualizations via relational schemata. In: Proceedings of the working conference on Advanced Visual Interfaces(AVI’00), pp.128–135. ACM Press, New York (2000)",
    "Takatsuka M., Gahegan M.: GeoVISTA studio: a codeless visual programming environment for geoscientific data analysis and visualization. Computers and Geosciences. 28, 1131–1144 (2002)",
    "Godinho P.I., Meiguins B.S., Meiguins A.S,, Carmo R.M., Carcia M.B., Almeida L.H., Lourenco R.: PRISMA-A multidimensional information visualization tool using multiple coordinated views. In: Proceedings of 11th International Conference on Information Visualization(IV’07), pp. 23–32. IEEE Computer Science Press, Washington (2007)",
    "Stolte C., Tang D., Hanrahan P.: Polaris: A system for query, analysis and visualization of multi-dimensional relational databases. IEEE Transactions on Visualization and Computer Graphics. 8, 1–14 (2002)",
    "Borner K., Zhou Y.: A software repository for education and research in information visualization. In: Proceedings of Fifth International Conference on Information Visualisation (IV’01), pp. 257–262. IEEE Computer Society Press, Los Alamitos (2001)",
    "Fekete J.D.: The InfoVis Toolkit. In: Proceedings of IEEE Symposium on Information Visualization(InfoVis’04), pp. 167–174. IEEE Computer Society Press, Washington (2004)",
    "Viegas F.B., Wattenberg M., van Ham F., Kriss J., McKeon M.: Many eyes: A site for visualization at internet scale. IEEE Transactions and Computer Graphics. 13, 1121–1128 (2007)",
    "Matkovic K., Freiler W., Gracanin D., Hauser H.: ComVis: A coordinated multiple views system for prototyping new visualization technology. In: Proceedings of 12th International Information Visualization, pp. 215–220. IEEE Computer Society Press, Washington (2008)",
    "Paterno F.: Model-based design and evaluation of interactive applications. Springer, Heidelberg (2000)",
    "Bederson B.B., Shneiderman B.: Ordered and Quantum Treemaps:Making Effective Use of 2D Space to Display Hierarchies. ACM Transactions on Graphics. 21, 833–854 (2002)",
    "Robertson G.G., Mackinlay J.D., Card S.K.: Cone Trees: Animated 3D Visualizations of Hierarchical Information. In: Proceedings of the SIGCHI conference on Human Factors in computing systems, pp. 189–194. ACM Press, New York (1991)",
    "Lamping J., Rao R.: The Hyperbolic Browser: A Focus + Context Technique for Visualizing Large Hierarchies. Journal of Visual Languages and Computing. 7, 33–55 (1996)",
    "Plaisant C., Grosjean J., Bederson B.: Spacetree: Supporting Exploration in Large Node Link Tree, Design Evolution and Empirical Evaluation. In: Proceedings of IEEE Symposium on Information Visualization (InfoVis’02), pp. 57–64. IEEE Press, Boston (2002)",
    "Heer J., Card S.K.: DOITrees revisited: scalable, space-constrained visualization of hierarchical data. In: Proceedings of the working conference on Advanced visual interfaces(AVI’04), pp. 421–424. ACM Press, New York (2004)",
    "Yang J., Ward M.O., Rundensteiner E.A.: InterRing: An Interactive Tool for Visually Navigating and Manipulating Hierarchical Structures. In: Proceedings of IEEE Symposium on Information Visualization (InfoVis’02), Boston, pp. 77-84. IEEE Press, Boston (2002)",
    "Wang W.X., Wang H., Dai G.Z., Wang H.: Visualization of Large Hierarchical Data by Circle Packing. In: Proceedings of the SIGCHI conference on Human Factors in computing systems(CHI’06), pp. 517–520. ACM Press, New York (2006)",
    "Eades P., Feng Q.W.: Multilevel Visualization of Clustered Graphs. In: Proceedings of the 4th Intl. Symposium on Graph Drawing, pp. 101–112. Springer, Heidelberg (1996)",
    "Eades P., Huang M.L.: Navigating Clustered Graphs using Force-Directed Methods. Journal of Graph Algorithms and Applications. 4, 157–181 (2000)",
    "Yee K.P., Fisher D., Dhamija R., Hearst M.S.: Animated exploration of dynamic graphs with radial layout. In: Proceedings of IEEE Symposium on Information(InfoVis’01), pp. 43–50. IEEE Computer Science Press, Los Alamitos (2001)",
    "Becker R.A., Cleveland W.S.: Brushing scatterplots. Technometrics. 29, 127–142 (1987)",
    "Inselberg A., Dimsdale B.: Parallel coordinates: a tool for visualizing multi-dimensional geometry. In: 1st conference on Visualization , pp. 23–26. IEEE Press, Washington (1990)",
    "Havre S., Hetzler B., Nowell L.: ThemeRiver: visualizing theme changes over time. In: IEEE Symposium on Information Visualization(InfoVis’00). pp. 115–123. IEEE Press, Washington (2000)",
    "Keim D.A., Schneidewind J., Sips M.: CircleView-A new approach for visualizing timerelated multidimensional data sets. In: Proceedings of the working conference on Advanced visual interfaces (AVI’04), pp. 179–182. ACM Press, New York (2004)",
    "Tominski C., Abello J., Schumann H.: Axes-Based Visualizations with Radial Layouts. In: ACM Symposium on Applied Computing, pp. 1242–1247. ACM Press, New York (2004)",
    "Graphviz, http://www.research.att.com/sw/tools/graphviz\n",
    "Marshall M.S., Herman I., Melancon G.: An object-oriented design for graph visualization. Software. Practice and Experience. 31, 739–756 (2001)",
    "Thomsen E.: OLAP Solutions: Building Multidimensional Information Systems. Wiley Computer Publishing, New York (1997)",
    "Krentzer W., Mckenzie B.: Programming for Artificial Intelligence, Method, Tools and Applications. Addison-Wesley, New Jersey (1991)",
    "Jeffrey H., Maneesh A.: Software Design Patterns for Information Visualization. IEEE Transactions on Visualization and Computer Graphics. 12, 853–860 (2006)",
    "Ren L., Wang W.X., Teng D.X., Ma C.X., Dai G.Z., Wang H.A.: A Focus+Context Technique for Interactive Visualization of Large Hierarchies (in Chiese). Journal of Software. 19, 3073–3082 (2008)",
    "Chris W.: Metavisual Exploration and Analysis of DEVise Coordination in Improvise. In: Fourth International Conference on Coordinated & Multiple Views in Exploratory Visualization (CMV’06), pp.79–90. IEEE Computer Science Press, Washington (2006)"
  ],
  "10.1007/978-1-4419-0312-9_15": [
    "Lyman, P., Varian H.R.: How Much Information? University of California at Berkeley, http://www2.sims.berkeley.edu/research/projects/how-much-info-2003/\n",
    "Newman, M. Watts, D., Barabási A.L.: The Structure and Dynamics of Networks, Princeton University Press (2006).",
    "Almaas, E. and Barabási A.L.: The Architecture of Complexity: From the WWW to Cellular Metabolism. In: Dynamics of Complex Interconnected Systems: Networks and Bioprocesses, NATO Sciences Series (2006).",
    "Malhotra, Y.: Enabling Knowledge Exchanges for E-Business Communities. Information Strategy: The Executive’s Journal, pp. 26-31 (2005).",
    "Ressler, S.: Social Network Analysis as an Approach to Combat Terrorism: Past, Present, and Future Research. Homeland Security Affairs, 2(2) (2006).",
    "Patton, S.: Social Network Analysis Helps Maximize Collective Smarts. http://www.cio.com/article/print/6956.",
    "Auber D.: Tulip: a Huge Graph Visualization Framework, Graph Drawing Software. Mathematics and Visualization, pp. 105-126 (2003).",
    "Abello J., van Ham F., Krishnan N.: ASK-GraphView: A Large Scale Graph Visualization System. IEEE Transactions on Visualization and Computer Graphics, 12(5), 2006.",
    "Gort, A., Gort, James.: Survey of Network Visualization Tools. Contract Report, DRDC Ottawa CR 2007-280, Defence R&D Canada, (2007).",
    "Thomas, J.J., Cook, K.A.: Illuminating the Path. IEEE Computer Society Press, Los Alamitos (2005).",
    "Keim D. et al: Visual Analytics: Definition, Process, and Challenges Information Visualization. LNCS 4950, pp. 154–175 (2008).",
    "National Visualization and Analytics Center (NVAC), http://nvac.pnl.gov.",
    "Kao, A.: Visual Analytics at the Boeing Company. VAC Consortium, (2008).",
    "Clarke, N. and Nipp T.: Foreign Animal and Zoonotic Diseases: An Information Analysis Framework. VAC Consortium (2007).",
    "Ribarsky, W.: Discovery Suspicious Financial Activity. VAC Consortium (2007).",
    "Wong, P. C., Chin Jr, G., Foote, H., Mackey, P., Thomas J.: Have Green – A Visual Analytics Framework for Large Semantic Graphs. In: IEEE Symposium on Visual Analytics Science and Technology (VAST2006), pp. 67-74 (2006).",
    "Gee, A. G. et al. Universal visualization platform. In: SPIE (2005).",
    "Newman, M.E.J.: The Structure and Function of Complex Networks. SIAM Review, 45, pp. 167-256 (2003).",
    "Huang M.L. and Nguyen Q.V.: A Fast Algorithm for Balanced Graph Clustering. In: 11th Int’l. Conf. on Information Visualisation (IV’07), IEEE, pp. 46-52 (2007).",
    "Newman M.E.J., Girvan M.: Finding and Evaluating Community Structure in Networks. Physical Review E, 69:026113 (2004).",
    "Nguyen, Q. V. and Huang, M. L.: EncCon: An Approach to Constructing Interactive Visualization of Large Hierarchical Data. Information Visualization Journal, Palgrave, 4(1), pp. 1-21 (2005).",
    "Eades, P.: A Heuristic for Graph Drawing. Congressus Numerantium, 42, pp. 149-60 (1984).",
    "Huang, M. L. and Nguyen, Q. V.: Large Graph Visualization by Hierarchical Clustering. Journal of Software, 19(8), pp. 1933-1946 (2008).",
    "Huang, M. L., Nguyen, Q. V.: Space-Filling Interaction with Chain-Context View. In: IEEE\nSymposium on Information Visualization 2008 (InfoVis 2008) - Poster Section, IEEE, Columbus, Ohio (2008).",
    "Eades, P., Lai, W., Misue, K. and Sugiyama, K.: Preserving the mental map of a diagram. In: Compugraphics 91, pp. 24-33 (1991).",
    "Ramsey, D. Highest-Resolution Scientific Display System. http://www.spafi.org."
  ],
  "10.1007/978-1-4419-0312-9_16": [
    "Jacquinot, G.: Les NTIC : écrans du savoir ou écrans au savoir. In: Chevalier, Y., Ateliers 9/1996, Outils multimédias et stratégies d’apprentissage du FLE, Cahiers de la Maison de la recherche, tome 1, Université Charles-de-Gaulle Lille 3, Lille (1996)",
    "Cohen, D.: Interfactives ou l’écran agi. Les métaphores à l’écran. In: Écrits. Images. Oral et Nouvelles technologies. Actes du séminaire 1994-1995. Under the responsability of Marie- Claude Vettraino-Soulard, Université Paris 7-Denis Diderot (1995)",
    "Piaget, J.: La naissance de l'intelligence de l'enfant. Delachaux & Niestlé, Neuchâtel (1936)",
    "Unreal Tournament 3, 2007, Epic Games, Midway Games: http://www.unrealtournament3.com/\n",
    "Natali, V.: Cube. Metropolitan FilmExport (1999)"
  ],
  "10.1007/978-1-4419-0312-9_17": [
    "Aarts, E. and Korts, J. (1989). Simulated Annealing and Boltzmann Machines. Wiley.",
    "Anderson, D, Anderson, E., Lesh, N. Marks, J. Mirtich, B. Ratajczak, D, and Ryall.K(2000) Human-guided Simple Search Conference Proc., of AAAI, pages 209-216. http://www.merl.com/papers/TR2000-16.",
    "Burke, E. K., Elliman D.G. Ford, P.H and Weare R.F.(1995), Examination Timetabling in British universities – A survey. In Int. Conference on the Practice and Theory of Automated Timetabling ICPTAT’95, Edinburgh, UK, Pages 423–434.",
    "Bartak, R. (1999). Constraint programming: In pursuit of the holy grail. Proc. of WDS99",
    "Cote, P., Wong, T., Sabourin, R. (2004) Application of a Hybrid Multi-objective EvolutionaryAlgorithm to the Uncapacitated Exam Proximity Problem. Proceedings of the 5th International Conference on the Practice and Theory of Automated Timetabling (PATAT2004), Pittsburgh, pp: 151–168.",
    "J.J. Thomas and K.A.Cook (2006) Illuminating the path: The R & D agenda for visual analytics\n",
    "Keim, D. A. (2000). An introduction to information visualization techniques for exploring large databases. In Tutorial Notes of the IEEE Int. Conference on Visualization. IEEE CS",
    "Keim D.A(2006), Florian Mansmann, Jorn Schneidewind, Hartmut Ziegler(2006) Challenges in Visual Data Analysis Tenth International Conference on Information Visualization (IV’06) pp. 9–16",
    "Sims, K. (1993). Interactive evolution of equations for procedural models. The Visual Computer, 9:466–476.",
    "J. Joshua Thomas, Ahamad Tajudin, Bahari Belaton, A Visual Analytics Framework for the Examination timetabling problem. Proc. 5th International Conference on Computer Graphics, Imaging and Visualization. CGIV, ISBN: 978-0-7695-3359-9 on page(s) pp, 305-310 IEEE Computer Society.",
    "Alexander Hinnderburg, D.A. Keim(2003) Visual interaction to solving complex optimization problems. Data visualization: The state-of-the-art Kluwer academic publishers London.",
    "R.Qu, E.K.Burke, B.McCollum, L.T.G.Merlot and S.Y.Lee (2009), A Survey of Search Methodologies and Automated System Development for Examination Timetabling, Journal of Scheduling 12(1), pp 55–89."
  ],
  "10.1007/978-1-4419-0312-9_18": [
    "Peden, M., et al., World report on road traffic injury prevention. 2004, World Health Organization: Geneva, Switzerland.",
    "Blincoe, L.J., et al., The Economic Impact of Motor Vehicle Crashes, 2000. 2002, National Highway Traffic safety Administration: Washington, D.C.",
    "Center for Excellence in Rural Safety, Rural Transportation Safety Research - Summary Report. 2007, Center for Excellence in Rural Safety: Minneapolis, MN.",
    "Tang, K.X. and N.M. Waters, The internet, GIS and public participation in transportation planning. Progress in Planning, 2005. 64(1): p. 7–62.",
    "Zhong, T., et al., A model for public involvement in transportation improvement programming using participatory Geographic Information Systems. Computers, Environment and Urban Systems, 2008. Volume 32(Issue 2): p. 123–133.",
    "Sieber, R., Public Participation Geographic Information Systems: A Literature Review and Framework. Annals of the Association of American Geographers, 2006. 96(3): p. 491–507.",
    "Hevner, A., et al., Design Science in Information Systems Research. MIS Quarterly, 2004. 28(1): p. 75-105.",
    "Baskerville, R. and A.T. Wood-Harper, Diversity in information systems action research methods. European Journal of Information Systems, 1998. 7(2): p. 90-107.",
    "Baskerville, R. and M.D. Myers, Special Issue on Action Research in Information Systems: Making IS Research Relevant to Practice - Foreword. MIS Quarterly, 2004. 28(3): p. 329- 335.",
    "Hilton, B., T. Horan, and B. Schooley. SafeRoadMaps: A GIS-based Mashup. in 2008 ESRI Business GIS Summit - University of Redlands Academic Track. 2008. Chicago, IL.",
    "Schooley, B., et al. Integrated Patient Health Information Systems to Improve Traffic Crash Emergency Response and Treatment. in Hawaii International Conference on Systems Sciences (HICSS-42). 2009. Waikoloa, Big Island, HI.",
    "Jazayeri, M., Some Trends in Web Application Development http://dx.doi.org/10.1109/FOSE.2007.26, in 2007 Future of Software Engineering. 2007, IEEE Computer Society. p. 199-213.",
    "National Highway Traffic Safety Administration, FARS Overview. 2007, National Highway Traffic Safety Administration.",
    "National Center for Statistics and Analysis, FARS Encyclopedia. 2007, National Center for Statistics and Analysis.",
    "O’Reilly, T., What Is Web 2.0: Design Patterns and Business Models for the Next Generation of Software. 2005, O’Reilly Media, Inc.",
    "Merrill, D., Mashups: The new breed of Web app. 2006, IBM developerWorks.",
    "Stamey, J., et al., Client-side dynamic metadata in web 2.0 http://doi.acm.org/10.1145/1297144.1297176 in Proceedings of the 25th annual ACM international conference on Design of communication 2007 ACM: El Paso, Texas, USA p. 155-161",
    "Gibin, M., et al., An Exploratory Cartographic Visualisation of London through the Google Maps API. Applied Spatial Analysis and Policy, 2008.",
    "Ennals, R. and D. Gay, User-friendly functional programming for web mashups http://doi.acm.org/10.1145/1291151.1291187, in Proceedings of the 2007 ACM SIGPLAN international conference on Functional programming. 2007, ACM: Freiburg, Germany. p. 223-234.",
    "Garrett, J.J., Ajax: A New Approach to Web Applications. 2005, Adaptive Path Inc.",
    "Kei-Hoi Cheung, et al., HCLS 2.0/3.0: Health care and life sciences data mashup using Web 2.0/3.0. Journal of Biomedical Informatics, 2008. In Press, Corrected Proof.",
    "Seung-Jun Cha, et al., Integrating Ajax into GIS Web Services for Performance Enhancement, in Lecture Notes in Computer Science. 2007, Springer: Berlin / Heidelberg. p. 562-568.",
    "SmarterTools, I., SmarterStats Glossary. 2009, SmarterTools, Inc."
  ],
  "10.1007/978-1-4419-0312-9_19": [
    "Stasko, J. T., Domingue, J. B., Brown, M. H., Price, B. A.: Software Visualization, MIT Press (1998)",
    "Kanellopoulos, Y., Tjortjis, C.: Data Mining Source Code to Facilitate Program Comprehension: Experiments on Clustering Data Retrieved from C++ Programs. In: Proc. of the 12th International Workshop on Program Comprehension, Bari, Italy, pp. 214-225. IEEE CS Press (2004)",
    "Zaidman, A., Calders, T., Demeyer, S., Paredaens, J.: Applying Web Mining Techniques to Execution Traces to Support the Program Comprehension Process. In: Proc. of the 9th European Conference on Software Maintenance and Reengineering, Manchester, UK, pp. 134-142. IEEE CS Press, (2005)",
    "Newman, M. E. J.: The Structure and Function of Complex Networks. SIAM Review 45, 167-256 (2003)",
    "Mao, C.: DBViewer: A Tool for Visualizing and Measuring Dependency Relations between Tables in Database. In: Proc. of the 2009 World Congress on Software Engineering (WCSE 2009), Xiamen, China, pp. 13-17. IEEE CS Press (2009)",
    "Koschke, R.: Software Visualization in Software Maintenance, Reverse Engineering, and Re-engineering: A Research Survey. Journal of Software Maintenance and Evolution: Research and Practice, 15, pp. 87-109, John Wiley & Sons (2003)",
    "Tip, F.: A Survey of Program Slicing Techniques. Journal of Programming Languages, Vol.3, No. 3, pp. 121-189 (1995)",
    "Together, Borland, 2009. http://www.borland.com/together\n",
    "Fuggetta, A.: Software Process: A Roadmap. In: Proc. of the Conference on the Future of Software Engineering, Limerick, Ireland, pp. 25-34. ACM Press (2000)",
    "Rubin, V., Günther, C. W., Aalst, W. M. P., Kindler, E., Dongen, B. F., Schäfer, W.: Process Mining Framework for Software Processes. In: Wang Q., Pfahl D., Raffo D. M. (eds.): Software Process Dynamics and Agility, International Conference on Software Process, LNCS, vol. 4470, pp. 169-181, Springer, Heidelberg (2007)",
    "Souza, C. R. B., Quirk, S., Trainer, E., Redmiles, D.F.: Supporting Collaborative Software Development through the Visualization of Socio-Technical Dependencies. In: Proc. of the 2007 International ACM Conference on Supporting Group Work, pp. 147-156. ACM Press, New York (2007)",
    "Conway, M.: How Do Committees Invent. Datamation, 14, pp. 28-31 (1968)",
    "Amrit, C : Coordination in Software Development: The Problem of Task Allocation. ACM SIGSOFT Software Engineering Notes, vol. 30, no. 4, pp. 1-7, ACM Press (2005)",
    "Amrit, C., Hillegersberg, J.: Matrix Based Problem Detection in the Application of Software Process Patterns. In: Proc. of the 9th International Conference on Enterprise Information Systems, Funchal, Madeira, Portugal, June 12-16, vol. 3, pp. 316-320 (2007)",
    "Valetto G., Helander M., Ehrlich K., Chulani S., Wegman M., Williams C.: Using Software Repositories to Investigate Socio-technical Congruence in Development Projects. In: Proc. of the Fourth International Workshop on Mining Software Repositories, pp. 25-25. IEEE CS Press (2007)",
    "Faloutsos, M., Faloutsos, P., Faloutsos, C.: On Power-law Relationships of the Internet Topology. ACM SIGCOMM Computer Communication Review, vol. 29, no. 4, pp. 251-262 (1999)",
    "The DOT language, http://www.graphviz.org/doc/info/lang.html\n",
    "Graphviz, http://www.graphviz.org\n",
    "Bookstein, A.: Informetric Distributions, Part I: Unified Overview. Journal of the American Society for Information Science, 41, pp. 368-375 (1990)",
    "Pastor-Satorras, R., Vespingnani, A.: Epidemic Spreading in Scale-free Networks. Physical Review Letters, vol.86, no. 4, pp. 3200-3203 (2001)"
  ],
  "10.1007/978-1-4419-0312-9_20": [
    "P. Heymans P. Y. Schobbens J.C. Trigaux Y. Bontemps R. Matulevicius A. Classen, Evaluating formal properties of feature diagram languages, Software, IET, Volume 2, Issue 3, June 2008 Page(s):281 - 302",
    "KANG K., COHEN S., HESS J., NOVAK W., PETERSON S., Feature oriented domain analysis (FODA) feasibility study, Technical Report CMU/SEI-90-TR-21, Software Engineering Institute, Carnegie Mellon University, November 1990",
    "KANG K.C., KIM S., LEE J., KIM K., SHIN E., HUH M., FORM: a feature-oriented reuse method with domain-specific reference architectures, Ann. Softw. Eng., 1998, 5, pp. 143–168",
    "BATORY D.S., Feature models, grammars, and propositional formulas. Proc. 9th Int. Conf. Software Product Lines (SPLC’05), 2005, pp. 7 - 20",
    "Czarnecki, K.; Wasowski, A., Feature Diagrams and Logics: There and Back Again, Software Product Line Conference, 2007. SPLC 2007. 11th International 10-14 Sept. 2007 Page(s):23 - 34",
    "Power, D.J. A Brief History of Decision Support Systems. DSSResources.COM, World Wide Web, http://DSSResources.COM/history/dsshistory.html, version 4.0, March 10, 2007.",
    "P. Heymans P. Y. Schobbens J.C. Trigaux Y. Bontemps R. Matulevicius A. Classen, Evaluating formal properties of feature diagram languages, Software, IET, Volume 2, Issue 3, June 2008 Page(s):281 - 302",
    "Nenad Medvidovic , Eric M. Dashofy , Richard N. Taylor, Moving architectural description from under the technology lamppost, Information and Software Technology, v.49 n.1, p.12-31, January, 2007",
    "News Item Management System in http://keg.cs.tsinghua.edu.cn/GUIXML_Demo.zip\n",
    "F. Heidenreich and C. Wende. Bridging the gap between features and models. In 2nd Workshop on Aspect-Oriented Product Line Engineering (AOPLE’07) co-located with the 6th International Conference on Generative Programming and Component Engineering (GPCE’07). Online Proceedings, 2007. URL http://www.softeng.ox.ac.uk/aople/.",
    "K. Czarnecki and M. Antkiewicz. Mapping Features to Models: A Template Approach Based on Superimposed Variants. In R. Gl¨uck and M. Lowry, editors, Proceedings of the 4th International Conference on Generative Programming and Component Engineering (GPCE’05), volume 3676 of LNCS, pages 422–437. Springer, 2005.",
    "K. Czarnecki and K. Pietroszek. Verifying Feature-Based Model Templates Against Well-Formedness OCL Constraints. In Proceedings of the 5th International Conference on Generative Programming and Component Engineering (GPCE’06), pages 211–220, New York, NY, USA, 2006. ACM."
  ],
  "10.1007/978-1-4419-0312-9_21": [
    "G. F. Guimaraes et al., FPGA infrastructure for the development of augmented reality applications, Proceedings of the 20th annual conference on Integrated circuits and systems design, Copacabana, Rio de Janeiro, pp. 336-341, 2007.",
    "M. Maidi et al., Robust fiducials tracking in augmented reality, In IWSSIP ’06: The 13th International Conference on Systems, Signals and Image Processing, Budapest (Hungary), pp. 423-426, 2006.",
    "M. Maidi et al., A performance study for camera pose estimation using visual marker based tracking, Machine Vision and Applications, Springer-Verlag, 2008.",
    "I. Zendjebil et al., Outdoor augmented reality: State of the art and issues, VRIC’2008, pp. 177-187, 2008.",
    "R. Azuma et al., Recent advances in augmented reality, IEEE Computer Graphics and Applications, 21(6), pp. 34-47, 2001.",
    "B. Bell et al., An annotated situation awareness aid for augmented reality, Proc. of the 15th annual ACM symposium on User interface software and technology, New York, NY, USA, pp. 213-216, 2002.",
    "M. Dias et al., Usability evaluation of tangible user interfaces for augmented reality, IEEE International Augmented Reality Toolkit Workshop, Tokyo, Japan, pp. 54-61, 2003.",
    "H. Kato and M. Billinghurst, Marker tracking and HMD calibration for a video-based augmented reality conferencing system, Proc. of the 2nd IEEE and ACM International Workshop on Augmented Reality, Washington, DC, USA, 1999.",
    "H. Kato et al., Virtual object manipulation on a table-top ar environment, Proc. of the International Symposium on Augmented Reality, Munich, Germany, pp. 111-119, 2000.",
    "G. Klinker et al., ``Fata morgana'' a presentation system for product design, Proc. of the 1st International Symposium on Mixed and Augmented Reality, Washington, DC, USA, 2002.",
    "H. Kato et al., A city-planning system based on augmented reality with a tangible interface, Proc. of the 2nd IEEE/ACM International Symposium on Mixed and Augmented Reality, Washington, DC, USA, 2003.",
    "G. A. Lee et al., Occlusion based interaction methods for tangible augmented reality environments, Proc. of the 2004 ACM SIGGRAPH international conference on Virtual Reality continuum and its applications in industry, New York, NY, USA, pp. 419-426, 2004.",
    "B. E. Shelton and N. E. Hedley, Using augmented reality for teaching earthsun relationships to undergraduate geography students, ART ’02: The First IEEE International Augmented Reality Toolkit Workshop, Darmstadt, Germany, 2002.",
    "F. Ababsa and M. Mallem, Robust camera pose estimation using 2d fiducials tracking for real-time augmented reality systems, Proc. of the 2004 ACM SIGGRAPH international conference on Virtual Reality continuum and its applications in industry, Singapore, 2004.",
    "R. Koch et al., Markerless image-based 3D tracking for real-time augmented reality applications, Proc. WIAMIS 2005, Montreux, Switzerland, 2005.",
    "J. Park et al., Vision-based pose computation: robust and accurate augmented reality tracking, Proc. Augmented Reality 1999 (IWAR ’99), pp. 3-12, 1999.",
    "B. Jiang et al., Camera Tracking for Augmented Reality Media, Proc. IEEE Int’l Conf. Multimedia Expo 2000, Los Alamitos, Calif., pp. 1637-1640, 2000.",
    "U. Neumann and Y. Cho, A Self-Tracking Augmented Reality System, Proc. of ACM Virtual Reality Software and Technology 96, pp. 109-115, 1996.",
    "Y. Cho, Scalable Fiducial-Tracking Augmented Reality, Ph.D. Dissertation, Computer Science Department, University of Southern California, 1999.",
    "S. Malik et al., Robust 2d tracking for real-time augmented reality, Proc. Vision Interface, 2002.",
    "T. Lee and T. Hollerer, Multithreaded Hybrid Feature Tracking for Markerless Augmented Reality, IEEE Trans. on Visualization and Computer Graphics, vol. 15, no. 3, pp. 355-368, 2009.",
    "J. P. Lima et al., A Standalone Markerless 3D Tracker for Handheld Augmented Reality, arXiv:0902.2187, 2009.",
    "T. M. Peters et al., Towards a Medical Virtual Reality Environment for Minimally Invasive Cardiac Surgery, LNCS 5128, pp. 1-11, 2008.",
    "F. Henry et al., Augmented Reality Visualization for Laparoscopic Surgery, Proc. of First International Conference on Medical Image Computing and Computer-Assisted Intervention, MA, USA, pp. 11-13, 1998.",
    "T. Sielhorst et al., Advanced Medical Displays: A Literature Review of Augmented Reality, Journal of Display Technology, Vol. 4, Issue 4, pp. 451-467, 2008.",
    "N. Navab, Medical and Industrial Augmented Reality: Challenges for Real-Time Vision, Computer Graphics and Mobile Computing, LNCS 2191, 2001.",
    "J. Marescaux, Augmented-RealityAssisted Laparoscopic Adrenalectomy, JAMA, Vol. 292 No. 18, pp. 2214-2215, 2004.",
    "D. Balazs and E. Attila, Volumetric Medical Intervention Aiding Augmented Reality Device, Information and Communication Technologies, ICTTA’06, pp. 1091-1096, 2006.",
    "M. Blackwell et al., Augmented reality and its future in orthopaedics : Computer assisted orthopaedic surgery: Medical robotics and image guided surgery, Clinical orthopaedics and related research, No. 354, pp. 111-122, 1998.",
    "Medgadget, How About Augmented Reality in Clinical Applications?, http://blogs.nature.com/stories/893, 2009.",
    "A. Bornik et al., Computer aided liver surgery planning: An augmented reality approach, SPIE Medical Imaging’03, pp. 395-405, 2003.",
    "H. Fuchs et al., Augmented reality visualization for laparoscopic surgery, Proc. of the First International Conference on Medical Image Computing and Computer-Assisted Intervention, London, UK, pp. 934-943, 1998.",
    "K. Gary et al., Igstk: An open source software toolkit for image-guided surgery. Computer, 39(4), pp. 46-53, 2006.",
    "D. Gering et al., An integrated visualization system for surgical planning and guidance using image fusion and an open mr., Journal of Magnetic Resonance Imaging, volume 13, pp. 967-975, 2001.",
    "B. MacIntyre et al., Dart: The designer’s augmented reality toolkit, ISMAR, pp. 329-330, 2003.",
    "S. Nicolau et al., An augmented reality system to guide radio-frequency tumour ablation, Computer Animation and Virtual World, 16(1), pp. 1-10, 2005.",
    "M. Rosenthal et al., Augmented reality guidance for needle biopsies: An initial randomized, controlled trial in phantoms, Medical Image Analysis, volume 6, pp. 313-320, 2002.",
    "C. Paloc et al., Computer-aided surgery based on auto-stereoscopic augmented reality, Proc. of Information Visualisation, volume 13, Eighth, pp. 189-193, 2004.",
    "F.K. Wacker et al, An augmented reality system for mr image-guided needle biopsy: initial results in a swine model, Radiology, 2 (238), pp. 497-504, 2006.",
    "D. Trevisan et al., Augmented Medical Visualization, AMI-ARCS’04, pp. 57-66, 2004.",
    "J. Fischer et al, Occlusion Handling for Medical Augmented Reality using a Volumetric Phantom Model, VRST04, Hong Kong, 2004.",
    "A. Pandya et al., Tracking Methods for Medical Augmented Reality, MICCAI 2001, LNCS 2208, pp. 1404-1405, 2001.",
    "J. Fischer et al., A hybrid tracking method for surgical augmented reality, Computers and Graphics, 31, pp. 39-52, 2007.",
    "M. Nakamoto et al., Realtime Organ Tracking for Endoscopic Augmented Reality Visualization Using Miniature Wireless Magnetic Tracker, MIAR 2008, LNCS 5128, pp. 359-366, 2008.",
    "M. Rosenthal et al., Augmented Reality Guidance for Needle Biopsies: A Randomized, Controlled Trial in Phantoms, LNCS 2208, pp. 240-248, 2001.",
    "T. Sielhorst et al., An Augmented Reality Delivery Simulator for Medical Training, AMI-ARCS’04, pp. 11-20, 2004.",
    "P. J. Edwards et al, Clinical Experience and Perception in Stereo Augmented Reality Surgical Navigation, LNCS 3150, pp. 369-376, 2004.",
    "S. Nicolau et al., An Augmented Reality and Virtuality Interface for a Puncture Guidance System: Design and Validation on an Abdominal Phantom, MIAR 2004, LNCS 3150, pp. 302-310, 2004.",
    "D. Kalkofen et al., Integrated Medical Workflow for Augmented Reality Applications, Proc. AMI-ARCS, Copenhagen, Oct 2006.",
    "D. Kalkofen et al., Interactive Focus and Context Visualization in Augmented Reality, Proc. 6th IEEE International Symposium on Mixed and Augmented Reality, Nara, Japan, pp. 191-200, 2007.",
    "E. Samseta, et al., Augmented Reality in Surgical Procedures, Proc. of SPIE 2008.",
    "L. T. De Paolis, An Augmented Reality Application for Minimally Invasive Surgery, Proc. 14th Nordic-Baltic Conference on Biomedical Engineering and Medical Physics, pp. 489-492, 2008.",
    "R. C. Shetty : Augmented Reality Training Kit Can Offer Novel Teaching Solution For Future Cardiac Surgery And Other Medical Professionals, The Internet Journal of Medical Simulation, 2(1), 2006.",
    "Augmented reality improves training for keyhole surgery, http://www.news-medical.net/printarticle.asp?id=47683, 2009.",
    "M.B.I. Sanne et al., Augmented versus Virtual Reality Laparoscopic Simulation: What Is the Difference? A Comparison of the ProMIS Augmented Reality Laparoscopic Simulator versus LapSim Virtual Reality Laparoscopic Simulator, World J Surg 31, pp. 764-772, 2007.",
    "N. Navab et al., Action- and Workflow-Driven Augmented Reality for Computer-Aided Medical Procedures, IEEE Computer Graphics and Applications, 27(5), pp.10-14, 2007.",
    "A. Santhanam et al., Physically-based deformation of high-resolution 3D lung models for augmented reality based medical visualization, Proc. AMIARCS, Rennes, St. Malo, pp. 21-32, 2004.",
    "A. P. Santhanam et al., Modeling Real-Time 3-D Lung Deformations for Medical Visualization, IEEE Trans. on Information Technology in Biomedicine, 12(2), pp. 257-270, 2008.",
    "S. Nicolau t al., An accuracy certified augmented reality system for therapy guidance, ECCV’04, LNCS 3023, pp. 79-91, 2004.",
    "T. Studeli et al., Assessing Quality of Computer Systems and User Interfaces of Future Medical Workplaces Augmented Reality for Minimally Invasive Therapy, Proc. of the UITQ 2007 Workshop, Stockholm, Sweden, 2007.",
    "\nwww.mobile-augmented-reality.com/, 2009.",
    "M. Bang Nielsen et al., G Mobile Augmented Reality Support for Architects Based on Feature Tracking Techniques, ICCS 2004, LNCS 3038, pp. 921-928, 2004.",
    "\nwww.zenitum.com/mobile-augmented-reality.",
    "\nhttp://thefutureofads.com/2009/01/28/fanta-uses-mobile-augmented-reality-to-play-virtual-tennis/.",
    "\nhttp://technotecture.com/content/mobile-augmented-reality-sstt-mobile.",
    "\nwww.youtube.com/watch?v=RsZTbIjLHNA&feature=related.",
    "\nhttp://cb.nowan.net/blog/2009/02/17/kweekies-mobile-augmented-reality-game-by-int13/.",
    "J. L. Izkara et al., Mobile augmented reality, an advanced tool for the construction sector, 24th W78 Conference, Maribor, 2007.",
    "A. H. Behzadan, and V. R. Kamat, Animation of Construction Activities in Out-door Augmented Reality, Proc. of the Joint International Conference on Computing and Decision Making in Civil and Building Engineer-ing, Reston, VA. 2006.",
    "X. Wang and P. S. Dunston, Mixed Reality Enhanced Operator Interface for Teleoperation Systems in Unstructured Environment, CD Proc. of the 10th Biennial ASCE Aerospace Division International Confer-ence on Engineering, Construction and Operations in Chal-lenging Environments (Earth and Space 2006), League City/Houston, Texas, 2006.",
    "H. Kimura et al., System support for mobile augmented reality services, SAC07, Seoul, Korea, 2007.",
    "A. Olwal and A. Henrysson, LUMAR: A Hybrid Spatial Display System for 2D and 3D Handheld Augmented Reality, 17th International Conference on Artificial Reality and Telexistence, pp. 63-70, 2007.",
    "J. Rekimoto, NaviCam: A Magnifying Glass Approach to Augmented Reality, Presence: Teleoperators and Virtual Environments, vol. 6, no. 4, pp. 399-412, 1997.",
    "T. Starner et al., Augmented Reality through Wearable Computing, Presence: Teleoperators and Virtual Environments, 6(4), pp. 386-398, 1997.",
    "T. Hollerer et al., Exploring MARS: Developing Indoor and Outdoor User Interfaces to a Mobile Augmented Reality System, Computers and Graphics, 23(6), pp. 779-785, 1999.",
    "Y. Baillot et al., Authoring of Physical Models Using Mobile Computers, Proc. Intl Symp. Wearable Computers, IEEE CS Press, Los Alamitos, Calif., 2001.",
    "W. Piekarski et al., Integrating Virtual and Augmented Realities in an Outdoor Application, Proc. 2nd Intl Workshop Augmented Reality (IWAR 99), IEEE CS Press, Los Alamitos, Calif., pp. 45-54, 1999.",
    "B. Thomas et al., ARQuake: An Outdoor/Indoor Augmented Augmented Reality First Person Application, Proc. 4th Intl Symp. Wearable Computers (ISWC 2000), pp. 139-146, 2000.",
    "D. Stricker et al., Design and Development Issues for Archeoguide: An Augmented Reality based Cultural Heritage On-Site Guide, Proc. Intl Conf. Augmented Virtual Environments and 3D Imaging, Greece, pp. 1-5, 2001.",
    "J. Rekimoto et al., Augmentable Reality: Situated Communication through Physical and Digital Spaces, Proc. 2nd Intl Symp. Wearable Computers, IEEE CS Press, Los Alamitos, Calif., pp. 68-75, 1998.",
    "R. Behringer et al., A Wearable Augmented Reality Testbed for Navigation and Control, Built Solely with Commercial- off-the-Shelf (COTS) Hardware, Proc. Intl Symp. Augmented Reality 2000, Calif., pp. 12-19, 2000.",
    "R. Azuma, J. Leonard, Performance Analysis of an Outdoor Augmented Reality Tracking System that Relies Upon a Few Mobile Beacons, Proc. of ISMAR 2006, Santa Barbara, CA, pp. 119-122, 2006.",
    "A. Henrysson et al., Face to Face Collaborative AR on Mobile Phones, Proc. of ISMAR 2005, 2005.",
    "W. Piekarski et al., Designing Backpacks for High Fidelity Mobile Outdoor Augmented Reality, Proc. of ISMAR’04, Arlington, 2004.",
    "D. Wagner and D.Schmalstieg, ARToolKitPlus for Pose Tracking on Mobile Devices, Computer Vision Winter Workshop 2007, Austria, 2007.",
    "A. Stork et al., IMPROVE: An innovative application for collaborative mobile mixed reality design review, Proc. of Virtual Concept 06, 2006.",
    "A. Cheok et al., Human Pacman: A Mobile Entertainment System with Ubiquitous Computing and Tangible Interaction over a Wide Outdoor Area, Human-Computer Interaction with Mobile Devices and Services, LNCS 2795, pp. 209-223, 2003.",
    "J., Zauner and M. Haller, Authoring of Mixed Reality Applications including Multi-Marker calibration for Mobile Devices, Proc. of 10th Eurographics Symposium on Virtual Environments, pp. 87-90, 2004.",
    "P. Renevier et al., Generic Interaction Techniques for Mobile Collaborative Mixed Systems, Fifth International Conference on Computer-Aided Design of User Interfaces CADUI’2004, ACM, Funchal, pp. 307-320, 2004.",
    "J. Gausemeier et al., Development of a Real Time Image Based Object Recognition Method for Mobile AR-Devices, Proc. of the ACM SIGGRAPH AFRIGRAPH 2003: 2nd International Conference on Computer Graphics, Virtual Reality, Visualisation and Interaction in Africa, Cape Town, 2003.",
    "S. DiVerdi and T. Hollerer, GroundCam: A Tracking Modality for Mobile Mixed Reality, IEEE Virtual Reality, Charlotte, North Carolina, USA, pp. 75-82, 2007.",
    "M. Torabi, Mobile Virtual Reality Services, Bell Labs Technical Journal. 7(2), pp. 185-193, 2002.",
    "A.D. Cheok, et al., Human Pacman: A Mobile Entertainment System with Ubiquitous Computing and Tangible Interaction over a Wide Outdoor Area, Proc. Mobile HCI 2004 6th International Symposium, Glasgow, UK, pp.209-223, 2004.",
    "D.J. McCaffery, and J. Finney, The need for real time consistency management in P2P mobile gaming environments, Proc. 2004 ACM SIGCHI International Conf of Advances in Computer Entertainment Technology, pp. 203-211, 2004.",
    "K. Mitchell, et al., Six in the City: Introducing Real Tournament A Mobile IPv6 based Context-Aware Multiplayer Game, Proc. 2nd Workshop on Network and System Support for Games, pp. 91-100, 2003.",
    "G. Papagiannakis and N. Magnenat-Thalmann, Mobile Augmented Heritage: Enabling Human Life in ancient Pompeii, International Journal of Architectural Computing, Multi-Science Publishing, 5(2), pp. 395-415, 2007.",
    "S. Feiner, The importance of being mobile: Some social consequences of wearable augmented reality systems, Proc. IWAR’99 (IEEE and ACM Int. Workshop on Augmented Reality), San Francisco, CA, pp. 145-148, 1999.",
    "S. Feiner et al., Wearing it out: First steps toward mobile augmented reality systems, Mixed Reality: Merging Real and Virtual Worlds, Berlin, pp. 363-377, 1999.",
    "T. Hollerer et al., User interface management techniques for collaborative mobile augmented reality, Computers and Graphics, 25(5), pp. 799-810, 2001.",
    "T. Hollerer et al., Steps toward accommodating variable position tracking accuracy in a mobile augmented reality system, Proc. 2nd Int. Workshop on Artificial Intelligence in Mobile Systems, pp. 31-37, 2001.",
    "S. Julier et al., Information filtering for mobile augmented reality, Proc. ISAR’00 (IEEE and ACM Int. Symposium on Augmented Reality), pp. 3-11, Munich, Germany, 2000.",
    "G. Klinker et al., Augmented maintenance of powerplants: a prototyping case study of a mobile AR system, Proc. ISAR ’01 (IEEE and ACM Int. Symposium on Augmented Reality), New York, NY, pp. 124-133, 2001.",
    "G. Reitmayr, and D. Schmalstieg, Mobile collaborative augmented reality, Proc. ISAR ’01 (Int. Symposium on Augmented Reality), pp. 114-123, New York, NY, 2001.",
    "X. Zhang et al., Taking AR into large scale industrial environments: Navigation and information access with mobile computers, In Proc. ISAR ’01 (Int. Symposium on Augmented Reality), New York, NY, pp. 179-180, 2001.",
    "DWARF Project, http://ar.in.tum.de/Chair/ProjectDwarf.",
    "iPhone Apple, http://www.apple.com/iphone/.",
    "M. Mohring et al., Optical Tracking and Video Seethrough AR on Consumer Cell-Phones, Proc. International Symposium in Mixed and Aug-mented Reality, Arlington, USA, pp. 252-253, 2004.",
    "W. Pasman et al., Augmented Reality with Large 3D Models on a PDA, Implementation, Performance and Use Experiences, Int. Conf. on Virtual-Reality Continuum and Its Applications in Industry, Singapore, pp. 344-351, 2004.",
    "W. Piekarski, and B. Thomas, Tinmith evo5 An Architecture for Supporting Mobile Augmented Reality Environments, Proc. of the International Symposium on Augmented Reality, New York, USA., 2001.",
    "ULTRA Project ULTRA light Augmented Reality Mobile System, http://ist-ultra.org/publications.shtml, Feb 2007.",
    "D. Wagner and D. Schamalstieg, ARToolKit on the PocketPC platform, Proc. of the 2nd IEEE In-ternational Augmented Reality Toolkit Workshop, Tokyo, Japan, 2003.",
    "Zune Microsoft, www.zune.net, 2007.",
    "H. T. Hllerer and S. K. Feiner, Telegeoinformatics: Location-Based Computing and Services, Taylor and Francis Books Ltd., 2004.",
    "G. Papagiannakis et al., A survey of mobile and wireless technologies for augmented reality systems, Computer Animation and Virtual Worlds, 19(1), pp. 3-22, 2008.",
    "W. T. Fong et al., A Differential GPS Carrier Phase Technique for Precision Outdoor AR Tracking, IEEE International Symposium on Mixed and Augmented Reality 2008, pp. 25-28, 2008.",
    "D. Pustka and G. Klinker, Dynamic Gyroscope Fusion in Ubiquitous Tracking Environments, IEEE International Symposium on Mixed and Augmented Reality 2008, pp. 13-20, 2008.",
    "A. D. Cheok et al., Hunman Pacman: A Sensing-based entertainment System with Ubiquitous Computing and Tangible, Proc. of NetGame’03, pp. 106-117, 2003.",
    "D. Wagner et al., Pose Tracking from Natural Features on Mobile Phones, IEEE International Symposium on Mixed and Augmented Reality 2008, pp. 125-134, 2008.",
    "D. Wagner et al., Robust and Unobtrusive Marker Tracking on Mobile Phones, IEEE International Symposium on Mixed and Augmented Reality 2008, pp. 121-124, 2008.",
    "J. Tumler et al., Mobile Augmented Reality in Industrial Applications: Approaches for Solution of User-Related Issues, IEEE International Symposium on Mixed and Augmented Reality 2008, pp. 87-90, 2008.",
    "M. Hakkarainen et al., Augmented Assembly using a Mobile Phone, IEEE International Symposium on Mixed and Augmented Reality 2008, pp. 167-168, 2008.",
    "Kim and S. Won, Advanced Teleoperation, Graphics Aids, and Application to Time Delay Environments, Proc. of the 1st Industrial Virtual Reality Show and Conference (IVR’93), Makuhari Meese, Japan, pp. 202-207, 1993.",
    "Kim and S. Won, Virtual Reality Calibration and Preview / Predictive Displays for Telerobotics, Presence: Teleoperators and Virtual Environments 5(2), pp. 173-190, 1996.",
    "E. Oyama et al., Experimental Study on Remote Manipulation Using Virtual Reality, Presence: Teleoperators and Virtual Environments, pp. 112-124, 1993.",
    "G. Tharp et al., Virtual Window Telepresence System for Telerobotic Inspection, SPIE Proc. volume 2351, Telemanipulator and Telepresence Technologies, Boston, MA, pp. 366-373, 1994.",
    "T. H. J. Collett and B. A. MacDonald, Developer Oriented Visualisation of a Robot Program, Proc. 2006 ACM Conference on Human-Robot Interaction, pp. 49-56, 2006.",
    "B. Giesler et al., Using augmented reality to interact with an autonomous mobile platform. Proc. 2004 IEEE International Conference on Robotics and Automation, Piscataway, United States, pp. 1009-1014, 2004.",
    "F. Zhou et al., Trends in Augmented Reality Tracking, Interaction and Display: A Review of Ten Years of ISMAR, IEEE International Symposium on Mixed and Augmented Reality 2008, pp. 193-202, 2008.",
    "\nhttp://en.wikipedia.org/wiki/Augmentedreality.",
    "I. Sutheland, The ultimate display, In IFIP’65, pp. 506-508, 1965.",
    "M. Krueger, Artificial Reality, Addison-Wesley Professional, 1991.",
    "\nhttp://gamesalfresco.com/2008/12/14/2008-wrap-up-top-10-milestones-in-augmented-reality\n",
    "G. Klein and T. Drummond, Robust visual tracking for noninstrumented aug-mented reality, Proc. ISMAR’03, pp. 113-122, 2003.",
    "P. Corporation, Polhemus Trackers, http://www.together.com/trackres/ourprod.html.",
    "R. Azuma, Tracking Requirements for Augmented Reality, Communications of the ACM 36(7), pp. 50-51, 1993.",
    "K. Zikan et al., A note on dynamics of human head motions and on predictive filtering of head-set orientations, Proc. of SPIE, 2351, pp. 328-336, 1994.",
    "B.D. Adelstein et al., A Testbed for Characterizing Dynamic Response of Virtual Environment Spatial Sensors, Proc. of 5th Annual Symposium on User Interface Software and Technology, Monterey, CA, pp. 15-21, 1992.",
    "B. Donald, Gennery: Visual tracking of known three-dimensional objects, International Journal of Computer Vision, 7(3), pp. 243-270, 1992.",
    "D. Lowe, Robust model-based motion tracking through the integration of search and estimation, Intl. Journal of Computer Vision, 8, pp. 113-122, 1992.",
    "M. Armstrong and A. Zisserman, Robust object tracking, In Proc. Asian conference on Computer Vision, vol. I, pp. 58-61, 1995.",
    "L. Hohl and T. Quack, Markerless 3D Augmented Reality, Semester Thesis, CVL, ETH, 2003.",
    "T. Drummond and R. Cipolla, Real-time tracking of complex structureswith on-line camera calibration, Proc. British Machine Vision Conference (BMVC’99), vol. 2, BMVA, Nottingham, pp. 574-583, 1999.",
    "E. Marchand et al., Robust real-time visual tracking using a 2D-3D model-based approach, Proc. 7th IEEE International Conference on Computer Vision (ICCV’99), vol. 1, Kerkyra, Greece, pp. 262-268, 1999.",
    "G. Simon and M.O. Berger, A two-stage robust statistical method for temporal registration from features of various type, In Proc. 6th IEEE International Conference on Computer Vision (ICCV’98), Bombay, pp. 261-266, 1998.",
    "B. Espiau and F. Chaumette, A new approach to visual servoing, IEEE Trans. on Robotics and Automation, 8, pp. 313-326, 1992.",
    "V. Sundareswaran and R. Behringer, Visual servoing-based augmented reality, Proc. First IEEE Workshop on Augmented Reality (IWAR’98), San Francisco, pp. 193-200, 1999.",
    "R. Behringer et al., Model-based visual tracking for outdoor augmented reality, Proc. IEEE and ACM International Symposium on Mixed and Augmented Reality (ISMAR’02), Darmstadt, Germany, 2002.",
    "E. Marchand and F. Chaumette, Virtual visual servoing: a framework for realtime augmented reality, Proc. Eurographics 2002, 21(3), Saarbrcken, Germany, pp. 289-298, 2002.",
    "Z. BIAN et al., Real-Time Tracking Error Estimation for Augmented Reality for Registration with Linecode Markers, IEICE TRANS. INF. and SYST., VOL.E91D, NO.7, pp. 2041-2050, 2008.",
    "A. Comport et al., A real-time tracker for markerless augmented reality, Proc. ISMAR’03, pp. 36-45, 2003.",
    "H. Wuest et al., Adaptive line tracking with multiple hypotheses for augmented reality, Proc. ISMAR’05, pp. 62-69, 2005.",
    "G. Reitmayr and T. Drummond, Going out: robust model-based tracking for outdoor augmented reality, Proc. ISMAR’06, pp. 109-118, 2006.",
    "T. Okuma et al., A Natural Feature-Based 3D Object Tracking Method for Wearable Augmented Reality, AMC’04, Kawasaki, Japan, pp.451-456, 2004.",
    "J. Steinbis et al., 3D Fiducials for Scalable AR Visual Tracking, IEEE International Symposium on Mixed and Augmented Reality 2008, pp. 183-184, 2008.",
    "L. Vacchetti et al., Combining edge and texture information for real-time accurate 3d camera tracking, Proc. ISMAR ’04, pp. 48-57, 2004.",
    "E. Rosten and T. Drummond, Fusing points and lines for high performance tracking, Proc. 10th IEEE International Conference on Computer Vision (ICCV’05), vol. 2, Beijing, pp. 1508-1515, 2005.",
    "J.S. Jin et al., A Stable Vision System for Moving Vehicles, IEEE Trans. on Intelligent Transportation Systems, 1(1), pp. 32-39 2000.",
    "R.D Xu, J. G. Allen and J. S. Jin, Robust Mean-shift Tracking with Extended Fast Colour Thresholding, Proc. of 2004 International Symposium on Intelligent Multimedia, Video and Speech Processing, Hong Kong, pp. 542-545, 2004.",
    "L. Duan et al., A Unified Framework for Semantic Shot Classification in Sports Video, IEEE Trans. on Multimedia, 7(6), pp. 1066-1083, 2005.",
    "X. Tong et al., Periodicity Detection of Local Motion, Multimedia and Expo, ICME 2005, pp. 650-653, 2005.",
    "L. Duan and J.S. Jin et al., Nonparametric Motion Characterization for Robust Classification of Camera Motion Patterns, IEEE Trans. on Multimedia, 8(2), pp. 323-324, 2006.",
    "R.Y.D. Xu and J.S. Jin, Camera Control and Multimedia Interaction using Individual Object Recognition, JOURNAL OF MULTIMEDIA, 2(3), pp. 77-85, 2007.",
    "W. Lorensen et al., Enhancing Reality in the Operating Room, In Proc. of the 1993 IEEE Visualization Conference, pp. 410-415, 1993.",
    "W.E.L. Grimson et al., An Automated Registration Method for Frameless Stereotaxy, Image Guided Surgery, and Enhanced Reality Visulatization, Proc. IEEE Conference on Computer Vision and Pattern Recognition, pp. 430-436, 1994.",
    "J.P. Mellor, Enhanced Reality Visualization in a Surgical Environment, Masters thesis, AI Lab, Massachusetts Institute of Technology, 1995.",
    "W.E.L. Grimson et al., Evaluating and Validating an Automated Registration System for Enhanced Reality Visualization in Surgery, Proc. of Computer Vision, Virtual Reality, and Robotics in Medicine ’95, pp. 3-12, 1995.",
    "A. State et al., Case Study: Observing a Volume Rendered Fetus within a Pregnant Patient, Proc. of the 1994 IEEE Visualization Conference, pp. 364-368, 1994.",
    "M. Uenohara, and T. Kanade, Vision-Based Object Registration for Real-Time Image Overlay, Computer Vision, Virtual Reality and Robotics in Medicine: CVRMed ’95, pp. 14-22, 1995.",
    "F. Betting et al., A New Framework for Fusing Stereo Images with Volumetric Medical Images, Proc. of Computer Vision, Virtual Reality, and Robotics in Medicine ’95, pp. 30-39, 1995.",
    "G. Klein, Visual Tracking for Augmented Reality, PhD thesis, University of Cambridge, 2006.",
    "J. R. Vallino, Interactive Augmented Reality, PhD thesis, University of Rochester, 1998.",
    "C. Harris, Tracking with rigid models, A. Blake, ed., Active Vision, chap. 4, pp. 59-73, MIT Press, 1992.",
    "E. Foxlin et al., Flight Tracker: A novel optical/inertial tracker for cockpit enhanced vision, ISMAR’04, pp. 212-221, 2004.",
    "F. Sauer et al., Augmented reality visualization of ultrasound images: System description, calibration, and featur, Proc. International Symposium for Augmented Reality, New York, USA, 2001.",
    "F. Sauer et al., Augmented workspace: Designing an AR testbed, Proc. International Symposium for Augmented Reality, pp. 165-174, Munich, Germany, October 2000.",
    "F. Sauer et al., A head-mounted display system for augmented reality image guidance: Towards clinical evaluation for imriguided neurosurgery, Proc. MICCAI, Utrecht, The Netherlands, 2001.",
    "C. Ludwig and C. Reimann, Augmented Reality:Information at Focus, C-LAB Report, 4(1), Cooperative Computing & Communication Laboratory, 2005.",
    "K. Bonsor, How Augmented Reality Will Work, http://www.howstuffworks.com/augmented-reality.htm, 2009.",
    "R. Silva et al., Introduction to Augmented Reality, Technical Report: 25/2003, LNCC, Brazil, 2003.",
    "J.R. Vallino, Introduction to Augmented Reality, http://www.se.rit.edu/∼jrv/research/ar/introduction.html, 2002.",
    "M. Sairio, Augmented Reality, Helsinki University of Technology, 2002.",
    "R. Azuma. A survey of augmented reality, Teleoperators and Virtual Environments 6(4), pp. 355-385, 1997.",
    "R.L.S. SILVA et al., Augmented Reality for Scientific Visualization: Bringing Data Sets inside the Real World, Proc. SCSC’04, pp. 520-525, 2004.",
    "A. Scott et al., Human-Robot Collaboration: A Literature Review and Augmented Reality Approach in Design, International Journal of Advanced Robotic Systems, 5(1), pp. 1-18, 2008.",
    "E. Ethrigde, Head Mounted Displays (HMD), The Defense Advanced Research Projects Agency, http://www.darpa.mil/mto/displays/hmd/, Referenced 2001.",
    "MATRIX: visual-marker based Augmented Reality, http://www.sonycsl.co.jp/person/rekimoto/matrix/Matrix.html, 2009.",
    "B.C.A. Fernandes and J. F. Sanchez, Acceptance of an Augmented Reality system as a visualization tool for Computer-Aided Design classes, Interactive Educational Multimedia, 16, pp. 1-8, 2008.",
    "F.J. Toledo et al., Image Processing with CNN in a FPGA-Based Augmented Reality System for Visually Impaired People, IWANN 2005, LNCS 3512, pp. 906-912, 2005.",
    "K. Nagao and J. Rekimoto, Agent Augmented Reality: A Software Agent Meets the Real World, Proc. ICMAS-96, pp. 228-235, 1996.",
    "A.B. Brody and E. J. Gottsman, Pocket BargainFinder: A Handheld Device for Augmented Commerce, Proc. International Symposium on Handheld and Ubiquitous Computing (HUC’99), 1999.",
    "W. Zhu, et al., Personalized In-store E-Commerce with the PromoPad: an Augmented Reality Shopping Assistant, The Electronic Journal for E-Commerce Tools & Applications, 2004. 1(3).",
    "W. Zhu et al., Design of the PromoPad: an Automated Augmented Reality Shopping Assistant, 12th Americas Conference on Information Systems, Acapulco, Mexico, 2006.",
    "Yuzhu Lu and Shana Smith, Augmented Reality E-Commerce Assistant System: Trying While Shopping, Human-Computer Interaction, Part II, HCII 2007, LNCS 4551, pp. 643-652, 2007.",
    "Augmented Reality with Ford Ka campaign in Europe’s cities, http://www.everysingleoneofus.com/no-way-back-from-here/1–lay-of-the-land/case-studies/augmentedrealitywithfordkacampaignineuropescities, 2009.",
    "New MINI augmented reality ad is a creative masterpiece, http://www.automotto.org/entry/new-mini-augmented-reality-ad-is-a-creative-masterpiece/, 2009.",
    "M.A. Livingston et al., An augmented reality system for military operations in urban terrain, Proc. Interservice/Industry Training, Simulation, and Education Conference, (I/ITSEC ’02), Orlando, Florida, pp. 1-8, 2002.",
    "N.R. Hedley et al., Explorations in the use of augmented reality for geographic visualization, Presence: Teleoperators and Virtual Environments, 11(2), pp.119-133, 2002.",
    "A. Moore, Cubes, shadows and comic strips - a.k.a. interfaces, metaphors and maps?, In: 16th Annual Colloquium of the Spatial Information Research Centre, Dunedin, New Zealand, pp. 97-102, 2004.",
    "F. Liarokapis et al., Mobile Augmented Reality Techniques for GeoVisualisation, Proc. Ninth International Conference on Information Visualisation, pp. 745-751, 2005.",
    "W. Qi, A Vision-Based Augmented Reality System for Visualization Interaction, iv, Proc. Ninth International Conference on Information Visualisation, pp.404-409, 2005.",
    "C. Brenner, The Geoscope a Mixed- Reality System for Planning and Public Participation, UDMS 2006, 2006.",
    "F. Liarokapis et al., Exploring Urban Environments Using Virtual and Augmented Reality, Journal of Virtual Reality and Broadcasting, 3(5), pp. 1-13, 2007.",
    "J.M. Krisp, Geovisualization and knowledge discovery for decision making in ecological network planning, doctoral dissertation, Helsinki University of Technology, 2006.",
    "P. Ghadirian and I. D. Bishop, Integration of augmented reality and GIS: A new approach to realistic landscape visualisation, Landscape and Urban Planning, 86, pp. 226-232, 2008.",
    "S. Nebiker et al., Smart Point Clouds in Virtual Globes a New Paradigm in CityIModeling?, http://www.geovisualisierung.net/geovizhamburg/papers/092Nebiker.pdf, 2009.",
    "E. C. Urban, The Information Warrior, IEEE Spectrum, 32(11), pp. 66-70, 1995.",
    "Demo: Military Application : Operational contents manipulation on a virtual topographic map, http://www.arcane-technologies.com/?pageid=19, 2008.",
    "C. E. Howard, Department of Defense invests in delivering augmented reality technology to foot soldiers, http://mae.pennnet.com/displayarticle/291411/32/ARTCL/none/none/1/Department-of-Defense-invests-in-delivering-augmented-reality-technology-to-foot-soldiers/, 2007.",
    "Canadian helicopter verifies night vision system with Ascension’s laserBIRD, http://iar-ira.nrc-cnrc.gc.ca/press/news115e.html, 2004.",
    "K. Ahlers et al, Distributed Augmented Reality for Collaborative Design Applications, ECRC-95-03, 1995.",
    "S. Feiner et al., Architectural anatomy, In Presence, 4(3), pp. 318-325, 1995.",
    "A. Webster et al., Augmented reality in architectural construction, inspection and renovation, Proc. ASCE Third Congress on Computing in Civil Engineering, Anaheim, CA, pp. 913-919, 1996.",
    "B. Thomas, Using Augmented Reality to Visualize Architecture Designs in an Outdoor Environment, Design Computing on the Net November, 1999.",
    "K. Kensek et al., Augmented Reality: an application for architecture, Proc. 8th International Conference on Computing in Civil and Building Engineering, ASCE, Stanford, CA, pp. 294-301, 2000.",
    "J. Shen et al., Urban Planning Using Augmrnted Reslity, Journal of Urban Planning and Development, pp. 118-125, SEPTEMBER 2001.",
    "E. Ben-Joseph, Urban Simulation and the Luminous Planning Table: Bridging the Gap between the Digital and the Tangible, Journal of Planning and Education Research, Vol. 21, pp. 196-203, 2001.",
    "T. Gleue and P. Dahne, Design and Implementation of a Mobile Device for Outdoor Augmented Reality in the ARCHEOGUIDE Project, Proc. of the ACM Conference on Virtual reality, Archeology, and Cultural Heritage, pp. 161-168, 2002.",
    "H. Ishii et al., Augmented urban planning workbench: overlaying drawings, physical models and digital simulation, Proc. of the International Symposium on Mixed and Augmented Reality (ISMAR 2002), pp. 203-211, 2002.",
    "W. Piekarski and B. H. Thomas, Interactive Augmented Reality Techniques for Construction at a Distance of 3D Geometry, IPT/EGVE 2003, Zurich, Switzerland, 2003.",
    "J.M.S. Dias et al., A4D: Augmented Reality 4D System for Architecture and Building Construction, CONVR 2003, Virginia Tech, 2003.",
    "A. Malkawi et al., Interactive, Immersive Visualization for Indoor Environments: Use of Augmented Reality, Human-Computer Interaction and Building Simulation, Proc. of the Eighth International Conference on Information Visualization, pp. 833-838, 2004.",
    "W. Broll et al., ARTHUR: A Collaborative Augmented Environment for Architectural Design and Urban Planning, Proc. of Seventh International Conference on Humans and Computers, pp. 102-109, 2004.",
    "A.H. Behzadan and V.R. Kamat, Visualization of construction graphics in outdoor augmented reality, Proc. of the 2005 Winter Simulation Conference, pp. 1914-1920, 2005.",
    "C.T. Chen and T.W. Chang, Spatially Augmented Reality Design Environment, Innovations in Design & Decision Support Systems in Architecture and Urban Planning, Van Leeuwen, Dordrecht: Springer, pp. 487-499, 2006.",
    "A. Sa et al., Augmented reality to Aid Construction Management, CMNE/CILAMCE 2007, Portugal, 2007.",
    "Y. Guo et al., Application of Augmented Reality GIS in Architecture, Proc. The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences, Beijing, pp. 331-336, 2008.",
    "D.A. Belcher, Augmented Reality, Architecture and Ubiquity: Technologies, Theories and Frontiers, thesis, University of Washington, 2008.",
    "J. Lertlakkhanakul et al, Using the Mobile Augmented Reality Techniques for Construction Management, Proc. of the 10th International Conference on Computer Aided Architectural Design Research in Asia (CAADRIA 2005), pp. 396-403, 2005.",
    "W. Lonsing, Augmented Reality as Tool in Architecture, Proc. of the 22nd eCAADe Conference: Architecture in the Network Society, pp. 495-499, 2004.",
    "Malkawi, A. and R. Srinivasan, Building Performance Visualization Using Augmented Reality, Proc. of the Fourteenth International Conference on Computer Graphics and Vision, pp. 122-127, 2004.",
    "S. Park and J. Choi, Retrieving and Browsing Information of Building Equipment Using Augmented Reality Techniques, Proc. of the 9th International Conference on Computer Aided Architectural Design Research in Asia (CAADRIA 2004), pp. 911-926, 2004.",
    "H. Seichter and M.A. Schnabel, Digital and Tangible Sensation: An Augmented Reality Urban Design Studio, Proc. of the 10th International Conference on Computer Aided Architectural Design Research in Asia (CAADRIA 2005), pp. 193-202, 2005.",
    "M. Daily et al., World Embedded Interfaces for Human-Robot Interaction, Proc. of the 36th Hawaii International Conference on System Sciences (HICSS03), 2003.",
    "M. Stilman, Augmented Reality for Robot Development and Experimentation, report, Robotics Institute, Carnegie Mellon University, 2005.",
    "H. Worn et al., New augmented reality and robotic based methods for head-surgery, Int. J. Medical Robotics and Computer Assisted Surgery, 1(3), pp. 49-56, 2005.",
    "T. Akinbiyi et al., Dynamic Augmented Reality for Sensory Substitution in Robot-Assisted Surgical Systems, EMBS ’06, pp. 567-570, 2006.",
    "M. Kostandov et al., Robot gaming and learning using augmented reality, In ACM SIGGRAPH Technical Posters, San Diego, CA, USA, Aug 2007.",
    "J.W.S. Chong et al., Methodologies for Immersive Robot Programming in an Augmented Reality Environment, The International Journal of Virtual Reality, 6(1), pp. 69-79, 2007.",
    "H. Portilla and L. Basanez, Augmented Reality Tools for Enhanced Robotics Teleoperation Systems, Proc. 3DTV Conference 2007, pp. 1-4, 2007.",
    "J.C. Maida et al., Improving Robotic Operator Performance Using Augmented Reality, Proc. of the Human Factors and Ergonomics SocietyO 51st ANNUAL MEETING, pp. 1635-1639, 2007.",
    "N. Suzuki, Benefits of augmented reality function for laparoscopic and endoscopic surgical robot systems, Proc. MICCAI 2008, New York City, USA, 2008.",
    "H. Lee et al., Augmented Reality Based Vision System for Network Based Mobile Robot, APCHI 2008, LNCS 5068, pp. 123-130, 2008.",
    "I. Y. Chen at al., Markerless Augmented Reality for Robots in Unprepared Environments, Australian Conference on Robotics and Automation 2008, 2008.",
    "I. Y. Chen at al., Markerless Augmented Reality for Robotic Helicoptor Applications, RobVis 2008, LNCS 4931, pp. 125-138, 2008.",
    "J. Schulze-Ferebee, KUKA Roboter enhances perception of reality in robotics, KUKA Roboter GmbH, 2008.",
    "L. Su et al., Augmented Reality During Robot-assisted Laparoscopic Partial Nephrectomy: Toward Real-Time 3D-CT to Stereoscopic Video Registration, UROLOGY 73 (4), pp. 896-900, 2009.",
    "C. Java et al, An augmented reality interface for training robotics through the web, Proc. of the 40th International Symposium on Robotics, Barcelona, pp. 189-194, 2009.",
    "J. W. S. Chong et al., Robot programming using augmented reality: An interactive method for planning collision-free paths, Robotics and Computer-Integrated Manufacturing, 25(3), pp. 689-701, 2009.",
    "V. Raghavan et al., Interactive Evaluation of Assembly Sequences Using Augmented Reality, IEEE Trans. on Robotics and Automation, 15(3), pp. 435-449, 1999.",
    "O.W. Bertelsen and C. Nielsen, Augmented reality as a design tool for mobile interfaces, Proc. of the Third Conference on Designing Interactive Systems (DIS 2000), pp. 185-192, 2000.",
    "B. Schwald et al., Starmate: Using augmented reality technology for computer guided maintenance of complex mechanical elements, E-work and ECommerce, pp. 196-202, 2001.",
    "F. Fruend et al., AR-based Product Design in Automobile Industry, The First IEEE International Augmented Reality Toolkit Workshop, 2002.",
    "B. Schwald and B. Laval, An augmented reality system for training and assistance to maintenance in the industrial context, 11th International Conference in Central Europe on Computer Graphics, Visualization and Computer Vision’2003, 2003.",
    "S. Goose et al., Speech-Enabled Augmented Reality Supporting Mobile Industrial Maintenance, Pervasive Computing, pp. 65-70, JANUARYMARCH 2003.",
    "F.G. Hamza-Lup et al., Distributed training system with high-resolution deformable virtual models, Proc. of the 43rd Annu. ACM Southeast Conf., Kennesaw, GA, 2005.",
    "C. Ke et al., An Augmented reality-based Application for Equipment Maintenance, LNCS, 3784, pp. 836-841, 2005.",
    "Y.L. Poh et al., Facilitating Mechanical Design with Augmented Reality, Singapore-MIT Alliance Symposium, Singapore, 2005.",
    "H. Regenbrecht et al., Augmented Reality Projects in Automotive and Aerospace Industry, IEEE Computer Graphics and Applications, pp. 48-56, November/December 2005.",
    "W. Dangelmaier et al., Virtual and augmented reality support for discrete manufacturing system simulation, Computers in Industry, 56, pp. 371-383, 2005.",
    "A. E. Majoros and W. R. Jackson, Technology Augmented Reality for Space Flight Training and Mission Support American, American Astronautical Society National Conference and 52’nd Annual Meeting ``Building Bridges to Exploration: The Role of the International Space Station’’, Houston, Texas, 2005.",
    "B. Kang et al., An Augmented Reality System for Computer Maintenance, ICAT 2006, LNCS 4282, pp. 284-291, 2006.",
    "Y. Pang et al., Assembly feature design in an augmented reality environment, Assembly Automation, 26(1), pp. 34-43, 2006.",
    "M.L. Yuan et al., Augmented reality for assembly guidance using a virtual interactive tool, International Journal of Production Research, 46(7), pp. 1745-1767, 2006.",
    "J. Christian, Augmented Reality in Corporate Pervasive e-Education: Novel ways to support aviation maintenance training, Innovation North Research Conference 2006, Leeds Metropolitance University, 2006.",
    "M. Haller et al., Shared Design Space: Sketching ideas using digital pens and a large augmented tabletop setup, Proc. of the 16th International Conference on Artificial Reality and Telexistence, ICAT 2006, China, 2006.",
    "X. Wang and P. S. Dunston, Design, Strategies, and Issues towards an Augmented Reality-based Construction Training Platform, Journal of Information Technology in Construction, International Council for Research and Innovation in Building and Construction (CIB), 12, pp. 363-380, 2007.",
    "X. Wang et al., Perceptions of Augmented Reality in the Design Sector, 7th International Conference on Construction Applications of Virtual Reality, pp. 132-138, 2007.",
    "F.G. Hamza-Lup et al., Distributed Augmented Reality With 3-D Lung Dynamics-A Planning Tool Concept, IEEE Trans. on Information Technology in Biomedicine, 11(1), pp. 40-46, 2007.",
    "H. Wuest and D. Stricker, Tracking of industrial objects by using CAD models, Journal of Virtual Reality and Broadcasting, 4 (1), 2007.",
    "Z. Bian et al., Development of a Tracking Method for Augmented Reality Applied to NPP Maintenance Work and its Experimental Evaluation, IEICE Trans. on Information and Systems, E90-D(6), pp. 963-974, 2007.",
    "B. Reitinger et al., Augmented reality scouting for interactive 3d reconstruction, in Proc. of IEEE Virtual Reality, pp. 219-222, 2007.",
    "H. Ishii, Augmented Reality Applications for Nuclear Power Plant Maintenance Work, International Symposoum on Symbiotic Nuclear Power System for 21 Century (IAANP2008), pp. 262-268, 2008.",
    "X. Wang et al., An Empirical Study on Designers’ Perceptions of Augmented Reality within an Architectural FIRM, Information Technologies in Construction (ITcon), 13, pp. 536-551, 2008.",
    "J. Saaski et al, Integration of design and assembly using augmented reality, In Proc. IPAS’2008, Chamonix, France, 2008.",
    "A.H. Behzadan et al., General-purpose modular hardware and software frame-work for mobile outdoor augmented reality applications in engineering, Advanced Engineering Informatics, 22, pp. 90-105, 2008.",
    "D. Bradley et al., Augmented Reality on Cloth with Realistic Illumination, Machine Vision and Applications, 20 (2), 2009.",
    "C. Salzmann et al., Remote Experimentation: Improving User Perception Using Augmented Reality, NIWeek 2000, Austin, TX, pp. 17-20, 2000.",
    "M. Billinghurst et al., The MagicBookMoving Seamlessly between Reality and Virtuality, IEEE Comput. Graph, 21(3), pp. 6-8, 2001.",
    "J.R. Cooperstock, The classroom of the future: enhancing education through augmented reality, Proc. HCI Inter. 2001 Conf. on Human-Computer Interaction, New Orleans, USA, pp. 688-692, 2001.",
    "F. Liarokapis, Multimedia Augmented Reality Interface for E-learning (MARIE), World Trans. on Engineering and Technology Education, 1(2), pp. 173-176, 2002.",
    "B.E. Shelton and N.R. Hedley, Using augmented reality for teaching earth-sun relationships to undergraduate geography students, Proc. of the First IEEE International Augmented Reality Toolkit Workshop, Darmstadt, Germany, 2002.",
    "H. Kaufmann and D. Schmalstieg, Mathematics and geometry education with collaborative augmented reality, Computers and Graphics, vol. 27, pp. 339-345, 2003.",
    "S. Zagoranski and S. Divjak, Use of Augmented Reality in Education, Proc. EU-ROCON 2003 Ljubljana, Slovenia, pp. 339-342, 2003.",
    "H. Kaufmann, Geometry Education with Augmented Reality, Ph.D. Thesis. Vienna: Vienna University of Technology, 2004.",
    "H. Kaufmann et al., Improving Spatial Abilities by Geometry Education in Augmented Reality - Application and Evaluation Design, First International VR-Learning Seminar at Virtual Reality International Conference (VRIC), Laval, 2005.",
    "H. Kaufmann et al., General Training of Spatial Abilities by Geometry Education in Augmented Reality, Annual Review of CyberTherapy and Telemedicine: A Decade of VR, 3, pp. 65-76, 2005.",
    "H. Kaufmann, The Potential of Augmented Reality in Dynamic Geometry Education, 12th International Conference on Geometry and Graphics, Salvador, Brazil, 2006.",
    "H. Kaufmann and M. Papp, Learning Objects for Education with Augmented Reality, Proc. of EDEN 2006 (European Distance and E-Learning Network) Conference, Vienna 2006, pp. 160-165, 2006.",
    "A. Dnser et al., Virtual and Augmented Reality as Spatial Ability Training Tools, Proc. of the 7th ACM SIGCHI, Christchurch, New Zealand, pp. 125-132, 2006.",
    "Y.C. Chen, A study of comparing the use of augmented reality and physical models in chemistry education, Proc. of the 2006 ACM international conference on virtual reality continuum and its applications, pp. 369-372, 2006.",
    "H. Kaufmann and A. Dunser, Summary of Usability Evaluations of an Educational Augmented Reality Application, LNCS 4563, pp. 660-669, 2007.",
    "M. Olabe et al., Engineering Multimedia Contents with Authoring Tools of Augmented Reality, http://158.227.75.138/Joomla/images/pdf/inted2007rasmap2.pdf, 2007.",
    "M. Said and N. Ismail, Overview of Open Source Augmented Reality Toolkit, 1st International Malaysian Educational Technology Convention, 2007.",
    "E. Medina and S. Weghorst, Understanding biochemistry with Augmented Reality, Proc. of World Conference on Educational Multimedia, Hypermedia and Telecommunications 2007, pp. 4235-4239, 2007.",
    "M. Fjeld, Tangible User Interface for Chemistry Education: Comparative Evaluation and Re-Design, Proc. CHI 2007, San Jose, CA, USA, pp. 805-808, 2007.",
    "E.P. Affonso1 and A.C. Sementille, Support on the Remote Interaction for Augmented Reality System, 17th International Conference on Artificial Reality and Telexistence 2007, pp. 190-196, 2007.",
    "H. Kaufmann and B. Meyer, Simulating educational physical experiments in augmented reality, In Siggraph asia 08: Acm siggraph asia 2008 educators programme, pp. 1-8, 2008.",
    "P. Buchanan et al., Augmented Reality and Rigid Body Simulation for Edutainment, Proc. Advanced in Computer Entertainment Technology 2008, pp. 17-20, 2008.",
    "C. Juan et al., An Augmented Reality System for Learning the Interior of the Human Body, Proc. of the 2008 Eighth IEEE International Conference on Advanced Learning, pp. 186-188, 2008.",
    "E. Klopfer, Augmented learning: Research and Design of Mobile Educational Games, The MIT Press, 2008.",
    "M. Vilkoniene, Influence of augmented reality technology upon pupils’ knowledge about human digestive system: The results of the experiment, US-China Education Review, 6(1), pp. 36-43, 2009.",
    "P. Maier et al., Augmented Reality for teaching spatial relations, Conference of the International Journal of Arts & Sciences 2009, Toronto, 2009.",
    "K. Mase et al., Meta-Museum: A Supportive Augmented-Reality Environment by For Knowledge Sharing, International Conference on Virtual Systems and Multimedia 1996, pp. 107-110, 1996.",
    "S. Feineret al., A Touring Machine: Prototyping 3D Mobile Augmented Reality Systems for Exploring the Urban Environment, In Proc. ISWC’97, Cambridge, MA, pp. 74-81, 1997.",
    "D. Ingram, Trust-based Filtering for Augmented Reality, Proc. of the First International Conference on Trust Management, LNCS 2692, 2003.",
    "R. Wojciechowski et al., Building Virtual and Augmented Reality Museum Exhibitions, Proc. of the ninth international conference on 3D Web technology (2004), pp. 135-144, 2004.",
    "M. Martinez and G. Munoz, Designing augmented interfaces for guided tours using multimedia sketches, In Proc. of the Workshop MIXER’04, Funchal, Madeira, 2004.",
    "P.A.S. Sinclair, Integrating Hypermedia Techniques Integrating Hypermedia Techniques, Ph.D thesis, University of Southampton, 2004.",
    "F. Fritz et al., Enhancing Cultural Tourism experiences with Augmented Reality Technologies, The 6th International Symposium on Virtual Reality, Archaeology and Cultural Heritage VAST, 2005.",
    "F. Liarokapis and M. White, Augmented Reality Techniques for Museum Environments, The Mediterranean Journal of Computers and Networks, 1(2), pp. 90-96, 2005.",
    "A. Damala et al., Merging Augmented Reality Based Features in Mobile Multimedia Museum Guides, XXI International CIPA Symposium, Athens, Greece, 2006.",
    "D.H. Lee and J. Park, Augmented Reality Based Museum Guidance System for Selective Viewings, Second Workshop on Digital Media and its Application in Museum and Heritages, pp. 379-382, 2007.",
    "F. Diez-Diaz et al., An Accesible and Collaborative Tourist Guide Based on Augmented Reality and Mobile Devices, Universal Access in HCI 2007, LNCS 4555, pp. 353-362, 2007.",
    "H. Su et al., Research and Implementation of Hybrid Tracking Techniques in Augmented Museum Tour System, Edutainment 2008, LNCS 5093, pp. 636-643, 2008.",
    "S. Bres and B. Tellez, Localisation and Augmented Reality for Mobile Applications in Culture Heritage, http://www.commission5.isprs.org/3darch09/pdf/brestellez.pdf.",
    "B. Thomas, Challenges of Making Outdoor Augmented Reality Games Playable, In 2nd CREST Workshop on Advanced Computing and Communicating Techniques for Wearable Information Playing, 2003.",
    "D. Schmalstieg, Augmented reality techniques in games, Proc. Fourth IEEE and ACM International Symposium on Mixed and Augmented Reality, 2005.",
    "K. Kuikkaniemi et al., Toolkit for User-created Augmented Reality Games, MUM06, Stanford, CA, USA, 2006.",
    "W. Broll et al., Meeting Technology Challenges of Pervasive Augmented Reality Games, Netgames’06, Singapore, 2006.",
    "W. Litzlbauer et al., Neon Racer: Augmented Gaming, In 10th Central European Seminar on Computer Graphics, CESCG 2006, Slovakia, 2006.",
    "M. Rohs, Marker-Based Embodied Interaction for Handheld Augmented Reality Games, Journal of Virtual Reality and Broadcasting, 4(5), 2007.",
    "C. Geiger et al., Development of an Augmented Reality Game by Extending a 3D Authoring System, Proc. of the 2007 ACM SIGCHI international conference on Advances in computer entertainment technology, Salzburg, Austria, 2007.",
    "Z.O. Toups and A. Kerne, Location-Aware Augmented Reality Gaming for Emergency Response Education: Concepts and Development, CHI 2007, San Jose, USA, 2007.",
    "D.C. Silva and V. Vinhas, An Interactive Augmented Reality Battleship Game Implementation, Proc. Learning with Games, pp. 213-219, 2007.",
    "K. Cho et al., Ghost Hunter: A Handheld Augmented Reality Game System with Dynamic Environment, Entertainment Computing ICEC 2007, LNCS 4740, pp. 10-15, 2007.",
    "J. Schulz, Augmented Reality in Computer Games, http://campar.in.tum.de/Chair/TeachingSs07ArProseminar, 2007.",
    "Ohan Oda et al., Developing an Augmented Reality Racing Game, The Second International Conference on Intelligent Technologies for Interactive Entertainment (ICST INTETAIN ’08), 2008.",
    "H.S. Lee and J.W. Lee, Mathematical Education Game Based on Augmented Reality, Edutainment 2008, LNCS 5093, pp. 442-450, 2008.",
    "F.C. Luz et al., Augmented Reality for Games, DIMEA’08, Athens, Greece, 2008.",
    "G. N. Yannakakis and J. Hallam, Real-time Adaptation of Augmented-Reality Games for Optimizing Player Satisfaction, In Proc. of the IEEE Symposium on Computational Intelligence and Games, Perth, Australia, 2008.",
    "G. N. Yannakakis, How to Model and Augment Player Satisfaction: A Review, in Proc. of the 1st Workshop on Child, Computer and Interaction, ICMI’08, Chania, Crete, 2008."
  ],
  "10.1007/978-1-4419-0312-9_22": [
    "Fridrich, J., Goljan, M., Hogea, D.: Steganalysis of JPEG Images: Breaking the F5 Algorithm. In: Proceedings of the 5th Information Hiding Workshop, Lecture Notes in Computer Science, pp.310–323 (2002)",
    "Fridrich, J., Goljan, M., Hogea, D.: Attacking the Outguess. In: ACM Multimedia 2002 Workshop W2 - Workshop on Multimedia and Security: Authentication, Secrecy, and Steganalysis, pp.3–6 (2002)",
    "Zhang, T., Ping, X. J.: A new approach to reliable detection of LSB steganography in natural images. Signal Process, 83:2085—93 (2003)",
    "Avcibas, I., Memon, N., Sankur, B.: Steganalysis Based on Image Quality Metrics. In: IEEE 4th Workshop on Multimedia Signal Processing, pp.517—522 (2001)",
    "Avcibas, I., Khrrazi, M., Memon, N., Sankur, B.: Image steganalysis with binary similarity measures. EURASIP Journal on Applied Signal Processing, 17, pp.2749—2757 (2005)",
    "Lyu, S., Farid, H.: Detecting Hidden Messages Using Higher-Order Statistics and Support Vector Machines. In: Proc. of 5th International Workshop on Information Hiding, pp.340—354 (2002)",
    "Harmsen, J.J., Pearlman, W.A.: Steganalysis of Additive Noise Modelable Information Hiding. In: Proceedings of SPIE - The International Society for Optical Engineering, v.5020, pp.131—142 (2003)",
    "Fridrich, J.: Feature-based Steganalysis for JPEG Images and Its Implications for Future Design of Steganographic Schemes. In: Proc. 6th Int. Information Hiding Workshop, pp.67—81 (2004)",
    "Fu, D.D., Shi, Y.Q, Zou, D.K., Xuan, G.R.: JPEG steganalysis using empirical transition matrix in block DCT domain. In: IEEE 8th International Workshop on Multimedia Signal Processing, pp.310-313 (2006).",
    "Shi, Y.Q., Chen, C.H., Chen, W.: A Markov process based approach to effective attacking JPEG steganography. In: Proc. of the 8th Information Hiding Workshop, pp.249-264 (2007).",
    "Chen, C.H., Shi, Y.Q.: JPEG image steganalysis utilizing both intrablock and interblock correlations. In: IEEE International Symposium on Circuits and Systems, pp.3029-3032(2008).",
    "Shi, Y.Q., Chen, C., Chen, W.: A Markov process based approach to effective attacking JPEG steganography. In: Proc. of 8th International Workshop on Information Hiding, pp.249—264 (2006)",
    "Westfeld, A.: F5-a steganographic algorithm: high capacity despite better steganalysis. In: Proc. of the 4th Information Hiding Workshop, pp.289-302 (2001).",
    "Jsteg, http://ftp.funet.fi/pub/crypt/steganography/.",
    "Jphide&Seek, http://linux01.gwdg.de/∼alatham/stego.html.",
    "Provos, N.: Defending against statistical steganalysis. In: Proc. of the 10th Usenix Security Symposium, pp.323-335 (2001).",
    "Stefan, H., Petra, M.A.: graph-theoretic approach to steganography. In: Proc of the 9th IFIP TC-6 TC-11 International Conference, pp.119-128 (2005).",
    "Sallee, P.: Model based steganography. In: Proc. of the 2nd International Workshop on Digital Watermarking, pp.154–167 (2004).",
    "Sallee, P.: Model-based methods for steganography and steganalysis. International Journal of Image and Graphics, 5(1) pp.167-189 (2005).",
    "Cortes, C., Vapnik, V.: Support-Vector Networks. Machine Learning, vol.20, pp. 273—297 (1995)",
    "Chang, C.C., Lin, C.J.: LIBSVM: A Library for Support Vector Machines, http://www.csie.ntu.edu.tw/~cjlin/libsvm\n",
    "Greenspun Image Library, http://philip.greenspun.com\n"
  ],
  "10.1007/978-1-4419-0312-9_23": [
    "Iain E.G. Richardson: H.264 and MPEG-4 Video Compression-Video Coding for Nextgeneration Multimedia, John Wiley & Sons Inc, England (2005)",
    "Ki Beom Kim, Young Ghu Jeon, and Min-Cheol Hong: Variable Step Search Fast Motion Estimation for H.264/AVC Video Coder , IEEE Trans (2008)",
    "Li-Fu Ding, Pei-Kuei Tsung, Wei-Yin Chen, Shao-Yi Chien, and Liang-Gee Chen: Fast Motion Estimation with Inter-view Motion Vector Prediction For Stereo and Multi-view Video Coding , IEEE Trans (2008)",
    "Li-Shi Ping: Research on Network Faced Stereoscopic Video Coding and Transmission, Chinese Academic of Sciences (2006)",
    "Xu Bin, Yu Mei, Ye Xi-en , and Jiang Gang-yi: A fast disparity estimation algorithm for stereo video coding based on H.264, Journal of Zhejiang University(Science Edition) (2006).",
    "Chen Zhi-bo, Zhou Peng, and He Yun: Fast Integer Pixel and Fractional Pixel Motion Estimotion for JVT, JVT-F017, Japan (2002)",
    "Keng-Pang Lim, Gary Sullivan, and Thomas Wiegand: Text Description of Joint Model Reference Encoding Methods and Decoding Concealment Methods, JVT-O079, Korea (2005)",
    "ITU-T Rec. H.264| ISO/IEC 11496-10 AVC[S]. JM10.2"
  ],
  "10.1007/978-1-4419-0312-9_24": [
    "Turner Whitted: An Improved Illumination Model for Shaded Display. J. Communications of the ACM. 23 (6) :3432349(1980)",
    "Goral, C.M., Torrance, K.E., Greenberg, D.P., and Battaile, B.: Modeling the Interaction of Light between Diffuse Surfaces. Proceedings of the 11th annual conference on Computer Graphics and Interactive Techniques, pp. 213-222(1984)",
    "Henrik Wann Jensen: Importance Driven Path tracing Using the Photon Map. J. In: Proceedings of the 6th Eurographics Workshop on Rendering, pp. 326-335(1995)",
    "Henrik Wann Jensen: Global Illumination Using Photon Maps. In: Proceedings of the eurographics workshop on Rendering techniques, pp. 21-30(1996)",
    "Wang Jing, Wang Lili, Li Shuai: An Algorithm of the Expected Radiometric Transmission with All-frequency Shadow Based on GPU. J. In: computer research and development, 43 (9),pp. 1505-1510(2006)",
    "M.Tamura, H.Takizawa, and H.Kobayashi(Japan): A Parallel Image Generation Algorithm based on Photon Map Partitioning. In: Proceeding computer Graphics and Imaging(2008)",
    "Erik Reinhard, Alan Chalmers, Frederik W.Jansen: Hybrid Scheduling for Parallel Rendering Using Coherent Ray Tasks. In:Proceedings of the IEEE symposium on Parallel visualization and graphics, pp. 21-28(1999)",
    "Shawn Singh, Petros Faloutsos: SIMD Packet Techniques for Photon Mapping. In: IEEE/EG Symposium on Interactive Ray Tracing, pp. 87-94(2007)",
    "Shameem Akhter, Jason Roberts: Multi-Core Programming: Increasing Performance through Software Multi-threading. Intel Press.,US (2006)",
    "Mattson,T.G.,Sanders,B.A., Massingill,B.L.: Patterns for Parallel Programming. Addison-Wesley Professional, (2004)"
  ]
}